[Killed] ConditionalExpression
src/components/gist-card.ts:20:7
 function formatRelativeTime(dateStr: string): string {
   const now = Date.now();
   const dateTs = Date.parse(dateStr);
-  if (Number.isNaN(dateTs)) return '';
+  if (true) return '';
   const diffMs = now - dateTs;
   const diffSec = Math.floor(diffMs / 1000);
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Survived] ConditionalExpression
src/components/gist-card.ts:20:7
 function formatRelativeTime(dateStr: string): string {
   const now = Date.now();
   const dateTs = Date.parse(dateStr);
-  if (Number.isNaN(dateTs)) return '';
+  if (false) return '';
   const diffMs = now - dateTs;
   const diffSec = Math.floor(diffMs / 1000);

[Killed] ArithmeticOperator
src/components/gist-card.ts:21:18
   const now = Date.now();
   const dateTs = Date.parse(dateStr);
   if (Number.isNaN(dateTs)) return '';
-  const diffMs = now - dateTs;
+  const diffMs = now + dateTs;
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'JUST NOW';
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] ArithmeticOperator
src/components/gist-card.ts:22:30
   const dateTs = Date.parse(dateStr);
   if (Number.isNaN(dateTs)) return '';
   const diffMs = now - dateTs;
-  const diffSec = Math.floor(diffMs / 1000);
+  const diffSec = Math.floor(diffMs * 1000);
   if (diffSec < 60) return 'JUST NOW';
   const diffMin = Math.floor(diffSec / 60);
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] ConditionalExpression
src/components/gist-card.ts:23:7
   if (Number.isNaN(dateTs)) return '';
   const diffMs = now - dateTs;
   const diffSec = Math.floor(diffMs / 1000);
-  if (diffSec < 60) return 'JUST NOW';
+  if (true) return 'JUST NOW';
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}M AGO`;
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] EqualityOperator
src/components/gist-card.ts:23:7
   if (Number.isNaN(dateTs)) return '';
   const diffMs = now - dateTs;
   const diffSec = Math.floor(diffMs / 1000);
-  if (diffSec < 60) return 'JUST NOW';
+  if (diffSec >= 60) return 'JUST NOW';
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}M AGO`;
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] ArithmeticOperator
src/components/gist-card.ts:24:30
   const diffMs = now - dateTs;
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'JUST NOW';
-  const diffMin = Math.floor(diffSec / 60);
+  const diffMin = Math.floor(diffSec * 60);
   if (diffMin < 60) return `${diffMin}M AGO`;
   const diffHr = Math.floor(diffMin / 60);
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] EqualityOperator
src/components/gist-card.ts:25:7
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'JUST NOW';
   const diffMin = Math.floor(diffSec / 60);
-  if (diffMin < 60) return `${diffMin}M AGO`;
+  if (diffMin >= 60) return `${diffMin}M AGO`;
   const diffHr = Math.floor(diffMin / 60);
   if (diffHr < 24) return `${diffHr}H AGO`;
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] EqualityOperator
src/components/gist-card.ts:25:7
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'JUST NOW';
   const diffMin = Math.floor(diffSec / 60);
-  if (diffMin < 60) return `${diffMin}M AGO`;
+  if (diffMin <= 60) return `${diffMin}M AGO`;
   const diffHr = Math.floor(diffMin / 60);
   if (diffHr < 24) return `${diffHr}H AGO`;
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] ArithmeticOperator
src/components/gist-card.ts:26:29
   if (diffSec < 60) return 'JUST NOW';
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}M AGO`;
-  const diffHr = Math.floor(diffMin / 60);
+  const diffHr = Math.floor(diffMin * 60);
   if (diffHr < 24) return `${diffHr}H AGO`;
   const diffDay = Math.floor(diffHr / 24);
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] ConditionalExpression
src/components/gist-card.ts:27:7
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}M AGO`;
   const diffHr = Math.floor(diffMin / 60);
-  if (diffHr < 24) return `${diffHr}H AGO`;
+  if (false) return `${diffHr}H AGO`;
   const diffDay = Math.floor(diffHr / 24);
   return `${diffDay}D AGO`;
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Killed] EqualityOperator
src/components/gist-card.ts:27:7
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}M AGO`;
   const diffHr = Math.floor(diffMin / 60);
-  if (diffHr < 24) return `${diffHr}H AGO`;
+  if (diffHr >= 24) return `${diffHr}H AGO`;
   const diffDay = Math.floor(diffHr / 24);
   return `${diffDay}D AGO`;
killedBy: Gist Card renderCard renders relative time
statusReason: expected '\n    <article class="glass-card gist…' to contain '1H AGO'

[Survived] ArithmeticOperator
src/components/gist-card.ts:28:30
   if (diffMin < 60) return `${diffMin}M AGO`;
   const diffHr = Math.floor(diffMin / 60);
   if (diffHr < 24) return `${diffHr}H AGO`;
-  const diffDay = Math.floor(diffHr / 24);
+  const diffDay = Math.floor(diffHr * 24);
   return `${diffDay}D AGO`;
 }

[NoCoverage] BlockStatement
src/components/gist-card.ts:37:33
   updatedAt: string,
   lastSyncedAt?: string
 ): string {
-  if (syncStatus === 'pending') {
-    return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #3b82f6;">PENDING</div>';
-  }
+  if (syncStatus === 'pending') {}
   if (syncStatus === 'conflict') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">CONFLICT</div>';

[Survived] ConditionalExpression
src/components/gist-card.ts:37:7
   updatedAt: string,
   lastSyncedAt?: string
 ): string {
-  if (syncStatus === 'pending') {
+  if (false) {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #3b82f6;">PENDING</div>';
   }

[NoCoverage] BlockStatement
src/components/gist-card.ts:40:34
   if (syncStatus === 'pending') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #3b82f6;">PENDING</div>';
   }
-  if (syncStatus === 'conflict') {
-    return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">CONFLICT</div>';
-  }
+  if (syncStatus === 'conflict') {}
   if (syncStatus === 'error') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';

[Survived] ConditionalExpression
src/components/gist-card.ts:40:7
   if (syncStatus === 'pending') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #3b82f6;">PENDING</div>';
   }
-  if (syncStatus === 'conflict') {
+  if (false) {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">CONFLICT</div>';
   }

[Survived] ConditionalExpression
src/components/gist-card.ts:43:7
   if (syncStatus === 'conflict') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">CONFLICT</div>';
   }
-  if (syncStatus === 'error') {
+  if (false) {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';
   }

[NoCoverage] BlockStatement
src/components/gist-card.ts:43:31
   if (syncStatus === 'conflict') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">CONFLICT</div>';
   }
-  if (syncStatus === 'error') {
-    return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';
-  }
+  if (syncStatus === 'error') {}
   if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) > Date.parse(lastSyncedAt)) {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">STALE</div>';

[NoCoverage] StringLiteral
src/components/gist-card.ts:44:12
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">CONFLICT</div>';
   }
   if (syncStatus === 'error') {
-    return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';
+    return "";
   }
   if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) > Date.parse(lastSyncedAt)) {

[NoCoverage] EqualityOperator
src/components/gist-card.ts:46:50
   if (syncStatus === 'error') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';
   }
-  if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) > Date.parse(lastSyncedAt)) {
+  if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) >= Date.parse(lastSyncedAt)) {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">STALE</div>';
   }

[NoCoverage] BlockStatement
src/components/gist-card.ts:46:100
   if (syncStatus === 'error') {
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';
   }
-  if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) > Date.parse(lastSyncedAt)) {
-    return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">STALE</div>';
-  }
+  if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) > Date.parse(lastSyncedAt)) {}
   return '';
 }

[NoCoverage] StringLiteral
src/components/gist-card.ts:47:12
     return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #ef4444;">ERROR</div>';
   }
   if (syncStatus === 'synced' && lastSyncedAt && Date.parse(updatedAt) > Date.parse(lastSyncedAt)) {
-    return '<div class="sync-status-badge" style="display: inline-flex; align-items: center; gap: 4px; color: #f97316;">STALE</div>';
+    return "";
   }
   return '';

[Killed] LogicalOperator
src/components/gist-card.ts:57:7
  * Falls back to a safe prefix when CSS.escape is unavailable (Node/Vitest).
  */
 function escapeViewTransitionName(id: string): string {
-  if (typeof CSS !== 'undefined' && CSS.escape) {
+  if (typeof CSS !== 'undefined' || CSS.escape) {
     return CSS.escape(`gc-${id}`);
   }
killedBy: Gist Card renderCard renders article with gist-card class and data attributes
statusReason: Cannot read properties of undefined (reading 'escape')

[Killed] EqualityOperator
src/components/gist-card.ts:57:7
  * Falls back to a safe prefix when CSS.escape is unavailable (Node/Vitest).
  */
 function escapeViewTransitionName(id: string): string {
-  if (typeof CSS !== 'undefined' && CSS.escape) {
+  if (typeof CSS === 'undefined' && CSS.escape) {
     return CSS.escape(`gc-${id}`);
   }
killedBy: Gist Card renderCard renders article with gist-card class and data attributes
statusReason: Cannot read properties of undefined (reading 'escape')

[NoCoverage] ConditionalExpression
src/components/gist-card.ts:68:7
   if (!lastSyncedAt) return '';
   const updatedTs = Date.parse(updatedAt);
   const syncedTs = Date.parse(lastSyncedAt);
-  if (Number.isNaN(updatedTs) || Number.isNaN(syncedTs)) return '';
+  if (false) return '';
 
   const staleMs = updatedTs - syncedTs;

[NoCoverage] LogicalOperator
src/components/gist-card.ts:68:7
   if (!lastSyncedAt) return '';
   const updatedTs = Date.parse(updatedAt);
   const syncedTs = Date.parse(lastSyncedAt);
-  if (Number.isNaN(updatedTs) || Number.isNaN(syncedTs)) return '';
+  if (Number.isNaN(updatedTs) && Number.isNaN(syncedTs)) return '';
 
   const staleMs = updatedTs - syncedTs;

[NoCoverage] ArithmeticOperator
src/components/gist-card.ts:70:19
   const syncedTs = Date.parse(lastSyncedAt);
   if (Number.isNaN(updatedTs) || Number.isNaN(syncedTs)) return '';
 
-  const staleMs = updatedTs - syncedTs;
+  const staleMs = updatedTs + syncedTs;
   if (staleMs <= 0) return '';
 

[NoCoverage] ConditionalExpression
src/components/gist-card.ts:71:7
   if (Number.isNaN(updatedTs) || Number.isNaN(syncedTs)) return '';
 
   const staleMs = updatedTs - syncedTs;
-  if (staleMs <= 0) return '';
+  if (false) return '';
 
   const staleMin = Math.floor(staleMs / 60000);

[NoCoverage] EqualityOperator
src/components/gist-card.ts:71:7
   if (Number.isNaN(updatedTs) || Number.isNaN(syncedTs)) return '';
 
   const staleMs = updatedTs - syncedTs;
-  if (staleMs <= 0) return '';
+  if (staleMs < 0) return '';
 
   const staleMin = Math.floor(staleMs / 60000);

[NoCoverage] ArithmeticOperator
src/components/gist-card.ts:73:31
   const staleMs = updatedTs - syncedTs;
   if (staleMs <= 0) return '';
 
-  const staleMin = Math.floor(staleMs / 60000);
+  const staleMin = Math.floor(staleMs * 60000);
   const staleHr = Math.floor(staleMs / 3600000);
   const staleDay = Math.floor(staleMs / 86400000);

[NoCoverage] ArithmeticOperator
src/components/gist-card.ts:74:30
   if (staleMs <= 0) return '';
 
   const staleMin = Math.floor(staleMs / 60000);
-  const staleHr = Math.floor(staleMs / 3600000);
+  const staleHr = Math.floor(staleMs * 3600000);
   const staleDay = Math.floor(staleMs / 86400000);
 

[NoCoverage] ArithmeticOperator
src/components/gist-card.ts:75:31
 
   const staleMin = Math.floor(staleMs / 60000);
   const staleHr = Math.floor(staleMs / 3600000);
-  const staleDay = Math.floor(staleMs / 86400000);
+  const staleDay = Math.floor(staleMs * 86400000);
 
   let staleLabel: string;

[NoCoverage] EqualityOperator
src/components/gist-card.ts:78:7
   const staleDay = Math.floor(staleMs / 86400000);
 
   let staleLabel: string;
-  if (staleMin < 60) staleLabel = `${staleMin} MIN`;
+  if (staleMin >= 60) staleLabel = `${staleMin} MIN`;
   else if (staleHr < 24) staleLabel = `${staleHr} HOUR`;
   else staleLabel = `${staleDay} DAY`;

[NoCoverage] ConditionalExpression
src/components/gist-card.ts:78:7
   const staleDay = Math.floor(staleMs / 86400000);
 
   let staleLabel: string;
-  if (staleMin < 60) staleLabel = `${staleMin} MIN`;
+  if (false) staleLabel = `${staleMin} MIN`;
   else if (staleHr < 24) staleLabel = `${staleHr} HOUR`;
   else staleLabel = `${staleDay} DAY`;

[NoCoverage] ConditionalExpression
src/components/gist-card.ts:79:12
 
   let staleLabel: string;
   if (staleMin < 60) staleLabel = `${staleMin} MIN`;
-  else if (staleHr < 24) staleLabel = `${staleHr} HOUR`;
+  else if (true) staleLabel = `${staleHr} HOUR`;
   else staleLabel = `${staleDay} DAY`;
 

[NoCoverage] ConditionalExpression
src/components/gist-card.ts:79:12
 
   let staleLabel: string;
   if (staleMin < 60) staleLabel = `${staleMin} MIN`;
-  else if (staleHr < 24) staleLabel = `${staleHr} HOUR`;
+  else if (false) staleLabel = `${staleHr} HOUR`;
   else staleLabel = `${staleDay} DAY`;
 

[NoCoverage] StringLiteral
src/components/gist-card.ts:80:21
   let staleLabel: string;
   if (staleMin < 60) staleLabel = `${staleMin} MIN`;
   else if (staleHr < 24) staleLabel = `${staleHr} HOUR`;
-  else staleLabel = `${staleDay} DAY`;
+  else staleLabel = ``;
 
   return `<span class="staleness-indicator" title="Updated ${staleLabel} before last sync. Synced ${formatRelativeTime(lastSyncedAt)}">STALE: ${staleLabel}</span>`;

[Killed] ConditionalExpression
src/components/gist-card.ts:89:5
   const cached = cardCache.get(gist.id);
   if (
     cached &&
-    cached.updatedAt === gist.updatedAt &&
+    true &&
     cached.starred === gist.starred &&
     cached.syncStatus === gist.syncStatus &&
killedBy: Gist Card card caching re-renders when gist updatedAt changes
statusReason: expected '\n    <article class="glass-card gist…' to contain '2026-02-01'

[Killed] EqualityOperator
src/components/gist-card.ts:89:5
   const cached = cardCache.get(gist.id);
   if (
     cached &&
-    cached.updatedAt === gist.updatedAt &&
+    cached.updatedAt !== gist.updatedAt &&
     cached.starred === gist.starred &&
     cached.syncStatus === gist.syncStatus &&
killedBy: Gist Card card caching re-renders when gist updatedAt changes
statusReason: expected '\n    <article class="glass-card gist…' to contain '2026-02-01'

[Survived] ConditionalExpression
src/components/gist-card.ts:90:5
   if (
     cached &&
     cached.updatedAt === gist.updatedAt &&
-    cached.starred === gist.starred &&
+    true &&
     cached.syncStatus === gist.syncStatus &&
     cached.lastSyncedAt === gist.lastSyncedAt

[Survived] EqualityOperator
src/components/gist-card.ts:90:5
   if (
     cached &&
     cached.updatedAt === gist.updatedAt &&
-    cached.starred === gist.starred &&
+    cached.starred !== gist.starred &&
     cached.syncStatus === gist.syncStatus &&
     cached.lastSyncedAt === gist.lastSyncedAt

[Survived] EqualityOperator
src/components/gist-card.ts:91:5
     cached &&
     cached.updatedAt === gist.updatedAt &&
     cached.starred === gist.starred &&
-    cached.syncStatus === gist.syncStatus &&
+    cached.syncStatus !== gist.syncStatus &&
     cached.lastSyncedAt === gist.lastSyncedAt
   )

[Survived] ConditionalExpression
src/components/gist-card.ts:91:5
     cached &&
     cached.updatedAt === gist.updatedAt &&
     cached.starred === gist.starred &&
-    cached.syncStatus === gist.syncStatus &&
+    true &&
     cached.lastSyncedAt === gist.lastSyncedAt
   )

[Survived] EqualityOperator
src/components/gist-card.ts:92:5
     cached.updatedAt === gist.updatedAt &&
     cached.starred === gist.starred &&
     cached.syncStatus === gist.syncStatus &&
-    cached.lastSyncedAt === gist.lastSyncedAt
+    cached.lastSyncedAt !== gist.lastSyncedAt
   )
     return cached.html;

[Survived] ConditionalExpression
src/components/gist-card.ts:92:5
     cached.updatedAt === gist.updatedAt &&
     cached.starred === gist.starred &&
     cached.syncStatus === gist.syncStatus &&
-    cached.lastSyncedAt === gist.lastSyncedAt
+    true
   )
     return cached.html;

[Survived] MethodExpression
src/components/gist-card.ts:103:19
 
   // Get snippet of content if available
   const content = firstFile?.content || '';
-  const snippet = content.slice(0, 120);
+  const snippet = content;
 
   const staleHtml = renderStalenessTooltip(gist.updatedAt, gist.lastSyncedAt);

[NoCoverage] StringLiteral
src/components/gist-card.ts:107:7
 
   const staleHtml = renderStalenessTooltip(gist.updatedAt, gist.lastSyncedAt);
   const timeHtml = staleHtml
-    ? ''
+    ? "Stryker was here!"
     : `<time class="micro-label" datetime="${gist.updatedAt}">${formatRelativeTime(gist.updatedAt)}</time>`;
 

[Killed] StringLiteral
src/components/gist-card.ts:113:58
   const vtName = escapeViewTransitionName(gist.id);
 
   const html = `
-    <article class="glass-card gist-card${gist.starred ? ' featured' : ''}" data-gist-id="${sanitizeHtml(gist.id)}" data-testid="gist-item" tabindex="0" role="button"
+    <article class="glass-card gist-card${gist.starred ? "" : ''}" data-gist-id="${sanitizeHtml(gist.id)}" data-testid="gist-item" tabindex="0" role="button"
              style="view-transition-name: ${vtName}"
              aria-label="Open gist: ${sanitizeHtml(description)}">
killedBy: Gist Card renderCard renders "featured" class when gist is starred
statusReason: expected '\n    <article class="glass-card gist…' to contain 'featured'

[Killed] MethodExpression
src/components/gist-card.ts:118:52
              aria-label="Open gist: ${sanitizeHtml(description)}">
       <div class="gist-card-header">
         <div class="gist-card-meta">
-          <span class="micro-label">${sanitizeHtml(language.toUpperCase())}</span>
+          <span class="micro-label">${sanitizeHtml(language.toLowerCase())}</span>
           <h2 class="gist-card-title">${sanitizeHtml(description)}</h2>
         </div>
killedBy: Gist Card renderCard renders "TEXT" when language is not provided
statusReason: expected '\n    <article class="glass-card gist…' to contain 'TEXT'

[Survived] StringLiteral
src/components/gist-card.ts:132:48
       <footer class="gist-card-actions">
         <div class="action-group">
           <button class="gist-action-btn star-btn" data-id="${sanitizeHtml(gist.id)}"
-                  aria-label="${gist.starred ? 'Unstar' : 'Star'} gist"
+                  aria-label="${gist.starred ? "" : 'Star'} gist"
                   aria-pressed="${gist.starred}">
             <span class="micro-label">${gist.starred ? 'STARRED' : 'STAR'}</span>

[Survived] StringLiteral
src/components/gist-card.ts:132:59
       <footer class="gist-card-actions">
         <div class="action-group">
           <button class="gist-action-btn star-btn" data-id="${sanitizeHtml(gist.id)}"
-                  aria-label="${gist.starred ? 'Unstar' : 'Star'} gist"
+                  aria-label="${gist.starred ? 'Unstar' : ""} gist"
                   aria-pressed="${gist.starred}">
             <span class="micro-label">${gist.starred ? 'STARRED' : 'STAR'}</span>

[Killed] StringLiteral
src/components/gist-card.ts:134:68
           <button class="gist-action-btn star-btn" data-id="${sanitizeHtml(gist.id)}"
                   aria-label="${gist.starred ? 'Unstar' : 'Star'} gist"
                   aria-pressed="${gist.starred}">
-            <span class="micro-label">${gist.starred ? 'STARRED' : 'STAR'}</span>
+            <span class="micro-label">${gist.starred ? 'STARRED' : ""}</span>
           </button>
           <button class="gist-action-btn delete-btn" data-id="${sanitizeHtml(gist.id)}" aria-label="Delete gist">
killedBy: Gist Card renderCard renders star button with false aria-pressed when not starred
statusReason: expected '\n    <article class="glass-card gist…' to contain 'STAR'

[Killed] StringLiteral
src/components/gist-card.ts:134:56
           <button class="gist-action-btn star-btn" data-id="${sanitizeHtml(gist.id)}"
                   aria-label="${gist.starred ? 'Unstar' : 'Star'} gist"
                   aria-pressed="${gist.starred}">
-            <span class="micro-label">${gist.starred ? 'STARRED' : 'STAR'}</span>
+            <span class="micro-label">${gist.starred ? "" : 'STAR'}</span>
           </button>
           <button class="gist-action-btn delete-btn" data-id="${sanitizeHtml(gist.id)}" aria-label="Delete gist">
killedBy: Gist Card renderCard renders star button with correct aria-pressed state
statusReason: expected '\n    <article class="glass-card gist…' to contain 'STARRED'

[Survived] LogicalOperator
src/components/gist-card.ts:151:17
     html,
     updatedAt: gist.updatedAt,
     starred: gist.starred,
-    syncStatus: gist.syncStatus ?? 'synced',
+    syncStatus: gist.syncStatus && 'synced',
     lastSyncedAt: gist.lastSyncedAt,
   });

[Killed] ConditionalExpression
src/components/gist-card.ts:162:7
   onCardClick?: (id: string) => void,
   signal?: AbortSignal
 ): void {
-  if (container.dataset.eventsBound === 'true') return;
+  if (true) return;
 
   container.addEventListener(
killedBy: Gist Card bindCardEvents binds events only once (idempotent)
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] EqualityOperator
src/components/gist-card.ts:162:7
   onCardClick?: (id: string) => void,
   signal?: AbortSignal
 ): void {
-  if (container.dataset.eventsBound === 'true') return;
+  if (container.dataset.eventsBound !== 'true') return;
 
   container.addEventListener(
killedBy: Gist Card bindCardEvents binds events only once (idempotent)
statusReason: expected undefined to be 'true' // Object.is equality

[Killed] StringLiteral
src/components/gist-card.ts:165:5
   if (container.dataset.eventsBound === 'true') return;
 
   container.addEventListener(
-    'click',
+    "",
     (e) => {
       void (async () => {
killedBy: Gist Card bindCardEvents calls onCardClick when card body is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'click-test' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-card.ts:171:22
         const target = e.target as HTMLElement;
 
         const starBtn = target.closest('.star-btn') as HTMLElement;
-        if (starBtn) {
-          e.preventDefault();
-          e.stopPropagation();
-          const id = starBtn.dataset.id;
-          if (!id) return;
-          await gistStore.toggleStar(id);
-          return;
-        }
+        if (starBtn) {}
 
         const deleteBtn = target.closest('.delete-btn') as HTMLElement;
killedBy: Gist Card bindCardEvents calls toggleStar when star button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'star-test' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-card.ts:181:24
         }
 
         const deleteBtn = target.closest('.delete-btn') as HTMLElement;
-        if (deleteBtn) {
-          e.preventDefault();
-          e.stopPropagation();
-          const id = deleteBtn.dataset.id;
-          if (!id) return;
-          const confirmed = await showConfirmDialog('DELETE THIS GIST?');
-          if (!confirmed) return;
-          const ok = await gistStore.deleteGist(id);
-          if (ok) toast.success('GIST DELETED');
-          return;
-        }
+        if (deleteBtn) {}
 
         const card = target.closest('.gist-card') as HTMLElement;
killedBy: Gist Card bindCardEvents calls showConfirmDialog and deleteGist when delete button is clicked with confirmation
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/components/gist-card.ts:186:53
           e.stopPropagation();
           const id = deleteBtn.dataset.id;
           if (!id) return;
-          const confirmed = await showConfirmDialog('DELETE THIS GIST?');
+          const confirmed = await showConfirmDialog("");
           if (!confirmed) return;
           const ok = await gistStore.deleteGist(id);

[Killed] BooleanLiteral
src/components/gist-card.ts:187:15
           const id = deleteBtn.dataset.id;
           if (!id) return;
           const confirmed = await showConfirmDialog('DELETE THIS GIST?');
-          if (!confirmed) return;
+          if (confirmed) return;
           const ok = await gistStore.deleteGist(id);
           if (ok) toast.success('GIST DELETED');
killedBy: Gist Card bindCardEvents calls showConfirmDialog and deleteGist when delete button is clicked with confirmation
statusReason: expected "vi.fn()" to be called with arguments: [ 'delete-test' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-card.ts:187:15
           const id = deleteBtn.dataset.id;
           if (!id) return;
           const confirmed = await showConfirmDialog('DELETE THIS GIST?');
-          if (!confirmed) return;
+          if (false) return;
           const ok = await gistStore.deleteGist(id);
           if (ok) toast.success('GIST DELETED');

[Killed] ConditionalExpression
src/components/gist-card.ts:189:15
           const confirmed = await showConfirmDialog('DELETE THIS GIST?');
           if (!confirmed) return;
           const ok = await gistStore.deleteGist(id);
-          if (ok) toast.success('GIST DELETED');
+          if (false) toast.success('GIST DELETED');
           return;
         }
killedBy: Gist Card bindCardEvents shows success toast after successful delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'GIST DELETED' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-card.ts:189:15
           const confirmed = await showConfirmDialog('DELETE THIS GIST?');
           if (!confirmed) return;
           const ok = await gistStore.deleteGist(id);
-          if (ok) toast.success('GIST DELETED');
+          if (true) toast.success('GIST DELETED');
           return;
         }

[Killed] BlockStatement
src/components/gist-card.ts:194:34
         }
 
         const card = target.closest('.gist-card') as HTMLElement;
-        if (card && onCardClick) {
-          if (target.closest('.gist-card-actions')) return;
-          const id = card.getAttribute('data-gist-id');
-          if (id) onCardClick(id);
-        }
+        if (card && onCardClick) {}
       })();
     },
killedBy: Gist Card bindCardEvents calls onCardClick when card body is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'click-test' ]

Number of calls: 0
