[Survived] ConditionalExpression
src/routes/settings.ts:81:41
             <div class="form-group">
               <label class="form-label" for="theme-select">Theme</label>
               <select id="theme-select" class="form-input">
-                <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
+                <option value="light" ${false ? 'selected' : ''}>Light</option>
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>

[Survived] EqualityOperator
src/routes/settings.ts:81:41
             <div class="form-group">
               <label class="form-label" for="theme-select">Theme</label>
               <select id="theme-select" class="form-input">
-                <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
+                <option value="light" ${currentTheme !== 'light' ? 'selected' : ''}>Light</option>
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>

[Killed] ConditionalExpression
src/routes/settings.ts:82:40
               <label class="form-label" for="theme-select">Theme</label>
               <select id="theme-select" class="form-input">
                 <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
-                <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
+                <option value="dark" ${true ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
                 <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'dark' to be 'light' // Object.is equality

[Killed] EqualityOperator
src/routes/settings.ts:82:40
               <label class="form-label" for="theme-select">Theme</label>
               <select id="theme-select" class="form-input">
                 <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
-                <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
+                <option value="dark" ${currentTheme !== 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
                 <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'dark' to be 'light' // Object.is equality

[Killed] ConditionalExpression
src/routes/settings.ts:83:40
               <select id="theme-select" class="form-input">
                 <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
-                <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
+                <option value="auto" ${true ? 'selected' : ''}>Auto (System)</option>
                 <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
                 <option value="ambient" ${currentTheme === 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'auto' to be 'light' // Object.is equality

[Killed] EqualityOperator
src/routes/settings.ts:83:40
               <select id="theme-select" class="form-input">
                 <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
-                <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
+                <option value="auto" ${currentTheme !== 'auto' ? 'selected' : ''}>Auto (System)</option>
                 <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
                 <option value="ambient" ${currentTheme === 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'auto' to be 'light' // Object.is equality

[Killed] ConditionalExpression
src/routes/settings.ts:84:40
                 <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
-                <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
+                <option value="time" ${true ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
                 <option value="ambient" ${currentTheme === 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
               </select>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'time' to be 'light' // Object.is equality

[Killed] EqualityOperator
src/routes/settings.ts:84:40
                 <option value="light" ${currentTheme === 'light' ? 'selected' : ''}>Light</option>
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
-                <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
+                <option value="time" ${currentTheme !== 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
                 <option value="ambient" ${currentTheme === 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
               </select>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'time' to be 'light' // Object.is equality

[Killed] ConditionalExpression
src/routes/settings.ts:85:43
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
                 <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
-                <option value="ambient" ${currentTheme === 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
+                <option value="ambient" ${true ? 'selected' : ''}>Ambient Light (Opt-in)</option>
               </select>
             </div>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'ambient' to be 'light' // Object.is equality

[Killed] EqualityOperator
src/routes/settings.ts:85:43
                 <option value="dark" ${currentTheme === 'dark' ? 'selected' : ''}>Dark</option>
                 <option value="auto" ${currentTheme === 'auto' ? 'selected' : ''}>Auto (System)</option>
                 <option value="time" ${currentTheme === 'time' ? 'selected' : ''}>Time-based (Dark 7PM–7AM)</option>
-                <option value="ambient" ${currentTheme === 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
+                <option value="ambient" ${currentTheme !== 'ambient' ? 'selected' : ''}>Ambient Light (Opt-in)</option>
               </select>
             </div>
killedBy: Settings Route render renders theme options with current theme selected
statusReason: expected 'ambient' to be 'light' // Object.is equality

[Killed] BlockStatement
src/routes/settings.ts:122:69
  * Load and display the current GitHub PAT status in the settings UI.
  * Shows a rotation reminder if the token is older than 60 days.
  */
-async function loadTokenInfo(container: HTMLElement): Promise<void> {
-  const el = container.querySelector('#token-status');
-  const token = await getToken();
-  if (el) {
-    if (token) {
-      // Check token age for rotation reminder
-      const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
-      let rotationHtml = '';
-      if (savedAt) {
-        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
-        if (ageDays > 60) {
-          rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
-        }
-      }
-      el.innerHTML = `<p class="micro-label token-saved">Token active: ${sanitizeHtml(redactToken(token))}</p>${rotationHtml}`;
-    } else {
-      el.innerHTML = '<p class="micro-label token-missing">No token saved. Add one above.</p>';
-    }
-  }
-}
+async function loadTokenInfo(container: HTMLElement): Promise<void> {}
 
 /**
killedBy: Settings Route render renders token status when no token saved
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'No token saved'

[Killed] BlockStatement
src/routes/settings.ts:125:11
 async function loadTokenInfo(container: HTMLElement): Promise<void> {
   const el = container.querySelector('#token-status');
   const token = await getToken();
-  if (el) {
-    if (token) {
-      // Check token age for rotation reminder
-      const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
-      let rotationHtml = '';
-      if (savedAt) {
-        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
-        if (ageDays > 60) {
-          rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
-        }
-      }
-      el.innerHTML = `<p class="micro-label token-saved">Token active: ${sanitizeHtml(redactToken(token))}</p>${rotationHtml}`;
-    } else {
-      el.innerHTML = '<p class="micro-label token-missing">No token saved. Add one above.</p>';
-    }
-  }
+  if (el) {}
 }
 
killedBy: Settings Route render renders token status when no token saved
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'No token saved'

[Killed] BlockStatement
src/routes/settings.ts:126:16
   const el = container.querySelector('#token-status');
   const token = await getToken();
   if (el) {
-    if (token) {
-      // Check token age for rotation reminder
-      const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
-      let rotationHtml = '';
-      if (savedAt) {
-        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
-        if (ageDays > 60) {
-          rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
-        }
-      }
-      el.innerHTML = `<p class="micro-label token-saved">Token active: ${sanitizeHtml(redactToken(token))}</p>${rotationHtml}`;
-    } else {
+    if (token) {} else {
       el.innerHTML = '<p class="micro-label token-missing">No token saved. Add one above.</p>';
     }
killedBy: Settings Route render renders token status when token is saved
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'Token active'

[Survived] StringLiteral
src/routes/settings.ts:128:82
   if (el) {
     if (token) {
       // Check token age for rotation reminder
-      const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
+      const savedAt = await (await import('../services/db')).getMetadata<number>("");
       let rotationHtml = '';
       if (savedAt) {

[NoCoverage] BlockStatement
src/routes/settings.ts:130:20
       // Check token age for rotation reminder
       const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
       let rotationHtml = '';
-      if (savedAt) {
-        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
-        if (ageDays > 60) {
-          rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
-        }
-      }
+      if (savedAt) {}
       el.innerHTML = `<p class="micro-label token-saved">Token active: ${sanitizeHtml(redactToken(token))}</p>${rotationHtml}`;
     } else {

[NoCoverage] ArithmeticOperator
src/routes/settings.ts:131:25
       const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
       let rotationHtml = '';
       if (savedAt) {
-        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
+        const ageDays = (Date.now() - savedAt) * (1000 * 60 * 60 * 24);
         if (ageDays > 60) {
           rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;

[NoCoverage] ArithmeticOperator
src/routes/settings.ts:131:51
       const savedAt = await (await import('../services/db')).getMetadata<number>('token-saved-at');
       let rotationHtml = '';
       if (savedAt) {
-        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
+        const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 / 24);
         if (ageDays > 60) {
           rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;

[NoCoverage] EqualityOperator
src/routes/settings.ts:132:13
       let rotationHtml = '';
       if (savedAt) {
         const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
-        if (ageDays > 60) {
+        if (ageDays >= 60) {
           rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
         }

[NoCoverage] ConditionalExpression
src/routes/settings.ts:132:13
       let rotationHtml = '';
       if (savedAt) {
         const ageDays = (Date.now() - savedAt) / (1000 * 60 * 60 * 24);
-        if (ageDays > 60) {
+        if (false) {
           rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
         }

[Killed] StringLiteral
src/routes/settings.ts:136:22
           rotationHtml = `<p class="micro-label token-rotation">⚠️ Token is ${Math.floor(ageDays)} days old. Consider rotating it for security.</p>`;
         }
       }
-      el.innerHTML = `<p class="micro-label token-saved">Token active: ${sanitizeHtml(redactToken(token))}</p>${rotationHtml}`;
+      el.innerHTML = ``;
     } else {
       el.innerHTML = '<p class="micro-label token-missing">No token saved. Add one above.</p>';
killedBy: Settings Route render renders token status when token is saved
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'Token active'

[Killed] BlockStatement
src/routes/settings.ts:137:12
         }
       }
       el.innerHTML = `<p class="micro-label token-saved">Token active: ${sanitizeHtml(redactToken(token))}</p>${rotationHtml}`;
-    } else {
-      el.innerHTML = '<p class="micro-label token-missing">No token saved. Add one above.</p>';
-    }
+    } else {}
   }
 }
killedBy: Settings Route render renders token status when no token saved
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'No token saved'

[Killed] BlockStatement
src/routes/settings.ts:146:56
 /**
  * Render diagnostics info (online status, gist count, current theme) into the settings UI.
  */
-function loadDiagnostics(container: HTMLElement): void {
-  const diagnosticsContainer = container.querySelector('#diagnostics-info');
-  if (!diagnosticsContainer) return;
-
-  const info = {
-    online: networkMonitor.isOnline(),
-    gistsCount: gistStore.getGists().length,
-    theme: document.documentElement.getAttribute('data-theme'),
-  };
-
-  diagnosticsContainer.innerHTML = `
-    <div class="diagnostics-content micro-label">
-      <p>Online: ${info.online ? 'Yes' : 'No'}</p>
-      <p>Gists: ${info.gistsCount}</p>
-      <p>Theme: ${sanitizeHtml(info.theme || 'auto')}</p>
-    </div>
-  `;
-}
+function loadDiagnostics(container: HTMLElement): void {}
 
 /**
killedBy: Settings Route render renders diagnostics info
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'Online: Yes'

[Killed] StringLiteral
src/routes/settings.ts:147:56
  * Render diagnostics info (online status, gist count, current theme) into the settings UI.
  */
 function loadDiagnostics(container: HTMLElement): void {
-  const diagnosticsContainer = container.querySelector('#diagnostics-info');
+  const diagnosticsContainer = container.querySelector("");
   if (!diagnosticsContainer) return;
 
killedBy: Settings Route render renders settings sections
statusReason: Invalid selector

[Killed] StringLiteral
src/routes/settings.ts:156:36
     theme: document.documentElement.getAttribute('data-theme'),
   };
 
-  diagnosticsContainer.innerHTML = `
-    <div class="diagnostics-content micro-label">
-      <p>Online: ${info.online ? 'Yes' : 'No'}</p>
-      <p>Gists: ${info.gistsCount}</p>
-      <p>Theme: ${sanitizeHtml(info.theme || 'auto')}</p>
-    </div>
-  `;
+  diagnosticsContainer.innerHTML = ``;
 }
 
killedBy: Settings Route render renders diagnostics info
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'Online: Yes'

[Killed] StringLiteral
src/routes/settings.ts:158:34
 
   diagnosticsContainer.innerHTML = `
     <div class="diagnostics-content micro-label">
-      <p>Online: ${info.online ? 'Yes' : 'No'}</p>
+      <p>Online: ${info.online ? "" : 'No'}</p>
       <p>Gists: ${info.gistsCount}</p>
       <p>Theme: ${sanitizeHtml(info.theme || 'auto')}</p>
killedBy: Settings Route render renders diagnostics info
statusReason: expected '\n    <div class="route-settings">\n …' to contain 'Online: Yes'

[Survived] BlockStatement
src/routes/settings.ts:168:54
 /**
  * Load the saved accent hue from localStorage and apply it to the range input and display span.
  */
-function loadAccentHue(container: HTMLElement): void {
-  const input = container.querySelector('#accent-hue-input') as HTMLInputElement | null;
-  if (!input) return;
-  const raw = localStorage.getItem('accent-hue') || '220';
-  const parsed = Number.parseInt(raw, 10);
-  const saved = Number.isNaN(parsed) || parsed < 0 || parsed > 360 ? '220' : String(parsed);
-  input.value = saved;
-  const display = container.querySelector('#accent-hue-value');
-  if (display) {
-    display.textContent = saved;
-  }
-  document.documentElement.style.setProperty('--accent-h', saved);
-}
+function loadAccentHue(container: HTMLElement): void {}
 
 /**

[Survived] EqualityOperator
src/routes/settings.ts:173:55
   if (!input) return;
   const raw = localStorage.getItem('accent-hue') || '220';
   const parsed = Number.parseInt(raw, 10);
-  const saved = Number.isNaN(parsed) || parsed < 0 || parsed > 360 ? '220' : String(parsed);
+  const saved = Number.isNaN(parsed) || parsed < 0 || parsed >= 360 ? '220' : String(parsed);
   input.value = saved;
   const display = container.querySelector('#accent-hue-value');

[Survived] ConditionalExpression
src/routes/settings.ts:173:41
   if (!input) return;
   const raw = localStorage.getItem('accent-hue') || '220';
   const parsed = Number.parseInt(raw, 10);
-  const saved = Number.isNaN(parsed) || parsed < 0 || parsed > 360 ? '220' : String(parsed);
+  const saved = Number.isNaN(parsed) || false || parsed > 360 ? '220' : String(parsed);
   input.value = saved;
   const display = container.querySelector('#accent-hue-value');

[Killed] StringLiteral
src/routes/settings.ts:175:43
   const parsed = Number.parseInt(raw, 10);
   const saved = Number.isNaN(parsed) || parsed < 0 || parsed > 360 ? '220' : String(parsed);
   input.value = saved;
-  const display = container.querySelector('#accent-hue-value');
+  const display = container.querySelector("");
   if (display) {
     display.textContent = saved;
killedBy: Settings Route render renders settings sections
statusReason: Invalid selector

[Survived] BlockStatement
src/routes/settings.ts:176:16
   const saved = Number.isNaN(parsed) || parsed < 0 || parsed > 360 ? '220' : String(parsed);
   input.value = saved;
   const display = container.querySelector('#accent-hue-value');
-  if (display) {
-    display.textContent = saved;
-  }
+  if (display) {}
   document.documentElement.style.setProperty('--accent-h', saved);
 }

[Killed] BlockStatement
src/routes/settings.ts:188:11
 function bindEvents(container: HTMLElement, signal: AbortSignal): void {
   container.querySelector('#save-token-btn')?.addEventListener(
     'click',
-    () => {
-      const input = container.querySelector('#pat-input') as HTMLInputElement;
-      if (input.value) {
-        void (async () => {
-          await saveToken(input.value);
-          toast.success('TOKEN SAVED');
-          await loadTokenInfo(container);
-          input.value = '';
-        })();
-      } else {
-        toast.error('ENTER A TOKEN');
-      }
-    },
+    () => {},
     { signal }
   );
killedBy: Settings Route authentication saves token when save button is clicked with value
statusReason: expected "vi.fn()" to be called with arguments: [ 'ghp_newtoken123' ]

Number of calls: 0

[Killed] ConditionalExpression
src/routes/settings.ts:190:11
     'click',
     () => {
       const input = container.querySelector('#pat-input') as HTMLInputElement;
-      if (input.value) {
+      if (true) {
         void (async () => {
           await saveToken(input.value);
killedBy: Settings Route authentication shows error when save clicked with empty input
statusReason: expected "vi.fn()" to be called with arguments: [ 'ENTER A TOKEN' ]

Number of calls: 0

[Killed] ConditionalExpression
src/routes/settings.ts:190:11
     'click',
     () => {
       const input = container.querySelector('#pat-input') as HTMLInputElement;
-      if (input.value) {
+      if (false) {
         void (async () => {
           await saveToken(input.value);
killedBy: Settings Route authentication saves token when save button is clicked with value
statusReason: expected "vi.fn()" to be called with arguments: [ 'ghp_newtoken123' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:191:27
     () => {
       const input = container.querySelector('#pat-input') as HTMLInputElement;
       if (input.value) {
-        void (async () => {
-          await saveToken(input.value);
-          toast.success('TOKEN SAVED');
-          await loadTokenInfo(container);
-          input.value = '';
-        })();
+        void (async () => {})();
       } else {
         toast.error('ENTER A TOKEN');
killedBy: Settings Route authentication saves token when save button is clicked with value
statusReason: expected "vi.fn()" to be called with arguments: [ 'ghp_newtoken123' ]

Number of calls: 0

[Survived] StringLiteral
src/routes/settings.ts:195:25
           await saveToken(input.value);
           toast.success('TOKEN SAVED');
           await loadTokenInfo(container);
-          input.value = '';
+          input.value = "Stryker was here!";
         })();
       } else {

[Killed] BlockStatement
src/routes/settings.ts:197:14
           await loadTokenInfo(container);
           input.value = '';
         })();
-      } else {
-        toast.error('ENTER A TOKEN');
-      }
+      } else {}
     },
     { signal }
killedBy: Settings Route authentication shows error when save clicked with empty input
statusReason: expected "vi.fn()" to be called with arguments: [ 'ENTER A TOKEN' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:206:11
 
   container.querySelector('#remove-token-btn')?.addEventListener(
     'click',
-    () => {
-      void (async () => {
-        await removeToken();
-        toast.success('TOKEN REMOVED');
-        await loadTokenInfo(container);
-      })();
-    },
+    () => {},
     { signal }
   );
killedBy: Settings Route authentication removes token when remove button is clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/routes/settings.ts:207:25
   container.querySelector('#remove-token-btn')?.addEventListener(
     'click',
     () => {
-      void (async () => {
-        await removeToken();
-        toast.success('TOKEN REMOVED');
-        await loadTokenInfo(container);
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: Settings Route authentication removes token when remove button is clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/routes/settings.ts:209:23
     () => {
       void (async () => {
         await removeToken();
-        toast.success('TOKEN REMOVED');
+        toast.success("");
         await loadTokenInfo(container);
       })();
killedBy: Settings Route authentication removes token when remove button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'TOKEN REMOVED' ]

Received:

  1st vi.fn() call:

  [
-   "TOKEN REMOVED",

[Killed] StringLiteral
src/routes/settings.ts:216:27
     { signal }
   );
 
-  container.querySelector('#device-flow-login-btn')?.addEventListener(
+  container.querySelector("")?.addEventListener(
     'click',
     () => {
killedBy: Settings Route render renders settings sections
statusReason: Invalid selector

[NoCoverage] StringLiteral
src/routes/settings.ts:220:50
     'click',
     () => {
       void (async () => {
-        const statusEl = container.querySelector('#device-flow-status');
+        const statusEl = container.querySelector("");
         const loginBtn = container.querySelector('#device-flow-login-btn') as HTMLButtonElement;
         if (!statusEl || !loginBtn) return;

[NoCoverage] BooleanLiteral
src/routes/settings.ts:224:29
         const loginBtn = container.querySelector('#device-flow-login-btn') as HTMLButtonElement;
         if (!statusEl || !loginBtn) return;
 
-        loginBtn.disabled = true;
+        loginBtn.disabled = false;
         loginBtn.textContent = 'CONNECTING...';
         statusEl.textContent = 'Initializing...';

[NoCoverage] StringLiteral
src/routes/settings.ts:225:32
         if (!statusEl || !loginBtn) return;
 
         loginBtn.disabled = true;
-        loginBtn.textContent = 'CONNECTING...';
+        loginBtn.textContent = "";
         statusEl.textContent = 'Initializing...';
 

[NoCoverage] BlockStatement
src/routes/settings.ts:230:71
 
         try {
           const { authenticateWithDeviceFlow } = await import('../services/github/device-flow');
-          const result = await authenticateWithDeviceFlow((status) => {
-            statusEl.textContent = status;
-          });
+          const result = await authenticateWithDeviceFlow((status) => {});
 
           if (result.success) {

[NoCoverage] BlockStatement
src/routes/settings.ts:234:31
             statusEl.textContent = status;
           });
 
-          if (result.success) {
-            toast.success('AUTHENTICATED VIA GITHUB');
-            statusEl.textContent = 'Authentication successful!';
-            await loadTokenInfo(container);
-          } else {
+          if (result.success) {} else {
             toast.error('AUTHENTICATION FAILED');
             const errorMessages: Record<string, string> = {

[NoCoverage] StringLiteral
src/routes/settings.ts:235:27
           });
 
           if (result.success) {
-            toast.success('AUTHENTICATED VIA GITHUB');
+            toast.success("");
             statusEl.textContent = 'Authentication successful!';
             await loadTokenInfo(container);

[NoCoverage] BlockStatement
src/routes/settings.ts:238:18
             toast.success('AUTHENTICATED VIA GITHUB');
             statusEl.textContent = 'Authentication successful!';
             await loadTokenInfo(container);
-          } else {
-            toast.error('AUTHENTICATION FAILED');
-            const errorMessages: Record<string, string> = {
-              expired_token:
-                'The device code expired. Please click "SIGN IN WITH GITHUB" to try again.',
-              access_denied:
-                'You denied the authorization request. Click "SIGN IN WITH GITHUB" to try again.',
-              slow_down: 'GitHub rate-limited the request. Please wait a moment and try again.',
-              network_error: 'A network error occurred. Check your connection and try again.',
-              timeout:
-                'Authentication timed out. Please click "SIGN IN WITH GITHUB" to start over.',
-              save_error: 'Failed to save the token. Please try again.',
-            };
-            const msg = result.error
-              ? errorMessages[result.error] || result.errorDescription
-              : 'Authentication failed. Please try again.';
-            statusEl.textContent = msg || 'Authentication failed. Please try again.';
-          }
+          } else {}
         } catch {
           toast.error('AUTHENTICATION FAILED');
