[NoCoverage] StringLiteral
src/routes/settings.ts:242:17
             toast.error('AUTHENTICATION FAILED');
             const errorMessages: Record<string, string> = {
               expired_token:
-                'The device code expired. Please click "SIGN IN WITH GITHUB" to try again.',
+                "",
               access_denied:
                 'You denied the authorization request. Click "SIGN IN WITH GITHUB" to try again.',

[NoCoverage] StringLiteral
src/routes/settings.ts:249:27
               network_error: 'A network error occurred. Check your connection and try again.',
               timeout:
                 'Authentication timed out. Please click "SIGN IN WITH GITHUB" to start over.',
-              save_error: 'Failed to save the token. Please try again.',
+              save_error: "",
             };
             const msg = result.error

[NoCoverage] ConditionalExpression
src/routes/settings.ts:252:17
               save_error: 'Failed to save the token. Please try again.',
             };
             const msg = result.error
-              ? errorMessages[result.error] || result.errorDescription
+              ? false
               : 'Authentication failed. Please try again.';
             statusEl.textContent = msg || 'Authentication failed. Please try again.';

[NoCoverage] LogicalOperator
src/routes/settings.ts:252:17
               save_error: 'Failed to save the token. Please try again.',
             };
             const msg = result.error
-              ? errorMessages[result.error] || result.errorDescription
+              ? errorMessages[result.error] && result.errorDescription
               : 'Authentication failed. Please try again.';
             statusEl.textContent = msg || 'Authentication failed. Please try again.';

[NoCoverage] BlockStatement
src/routes/settings.ts:256:17
               : 'Authentication failed. Please try again.';
             statusEl.textContent = msg || 'Authentication failed. Please try again.';
           }
-        } catch {
-          toast.error('AUTHENTICATION FAILED');
-          statusEl.textContent = 'An unexpected error occurred. Please try again.';
-        } finally {
+        } catch {} finally {
           loginBtn.disabled = false;
           loginBtn.textContent = 'SIGN IN WITH GITHUB';

[NoCoverage] StringLiteral
src/routes/settings.ts:257:23
             statusEl.textContent = msg || 'Authentication failed. Please try again.';
           }
         } catch {
-          toast.error('AUTHENTICATION FAILED');
+          toast.error("");
           statusEl.textContent = 'An unexpected error occurred. Please try again.';
         } finally {

[NoCoverage] BlockStatement
src/routes/settings.ts:259:19
         } catch {
           toast.error('AUTHENTICATION FAILED');
           statusEl.textContent = 'An unexpected error occurred. Please try again.';
-        } finally {
-          loginBtn.disabled = false;
-          loginBtn.textContent = 'SIGN IN WITH GITHUB';
-        }
+        } finally {}
       })();
     },

[NoCoverage] BooleanLiteral
src/routes/settings.ts:260:31
           toast.error('AUTHENTICATION FAILED');
           statusEl.textContent = 'An unexpected error occurred. Please try again.';
         } finally {
-          loginBtn.disabled = false;
+          loginBtn.disabled = true;
           loginBtn.textContent = 'SIGN IN WITH GITHUB';
         }

[NoCoverage] StringLiteral
src/routes/settings.ts:261:34
           statusEl.textContent = 'An unexpected error occurred. Please try again.';
         } finally {
           loginBtn.disabled = false;
-          loginBtn.textContent = 'SIGN IN WITH GITHUB';
+          loginBtn.textContent = "";
         }
       })();

[Killed] ConditionalExpression
src/routes/settings.ts:278:11
         | 'time'
         | 'ambient';
       cleanupAmbientLightSensor();
-      if (theme === 'auto') {
+      if (false) {
         localStorage.removeItem('theme-preference');
         initTheme();
killedBy: Settings Route theme handles auto theme by removing preference
statusReason: expected 'auto' to be null

[Killed] ConditionalExpression
src/routes/settings.ts:278:11
         | 'time'
         | 'ambient';
       cleanupAmbientLightSensor();
-      if (theme === 'auto') {
+      if (true) {
         localStorage.removeItem('theme-preference');
         initTheme();
killedBy: Settings Route theme changes theme via select dropdown
statusReason: expected null to be 'dark' // Object.is equality

[Killed] BlockStatement
src/routes/settings.ts:281:39
       if (theme === 'auto') {
         localStorage.removeItem('theme-preference');
         initTheme();
-      } else if (theme === 'ambient') {
-        void (async () => {
-          if (signal.aborted) return;
-          const ok = await enableAmbientLightTheming();
-          if (signal.aborted) return;
-          if (!ok) {
-            // Fallback already handled inside enableAmbientLightTheming
-            // Refresh select to show the effective preference
-            const select = container.querySelector('#theme-select') as HTMLSelectElement;
-            const effective = getThemePreference() || 'auto';
-            select.value = effective;
-          }
-          if (signal.aborted) return;
-          loadDiagnostics(container);
-        })();
-        return;
-      } else {
+      } else if (theme === 'ambient') {} else {
         localStorage.setItem('theme-preference', theme);
         initTheme();
killedBy: Settings Route ambient theme selects ambient and calls enableAmbientLightTheming
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/routes/settings.ts:281:18
       if (theme === 'auto') {
         localStorage.removeItem('theme-preference');
         initTheme();
-      } else if (theme === 'ambient') {
+      } else if (false) {
         void (async () => {
           if (signal.aborted) return;
killedBy: Settings Route ambient theme selects ambient and calls enableAmbientLightTheming
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/routes/settings.ts:282:27
         localStorage.removeItem('theme-preference');
         initTheme();
       } else if (theme === 'ambient') {
-        void (async () => {
-          if (signal.aborted) return;
-          const ok = await enableAmbientLightTheming();
-          if (signal.aborted) return;
-          if (!ok) {
-            // Fallback already handled inside enableAmbientLightTheming
-            // Refresh select to show the effective preference
-            const select = container.querySelector('#theme-select') as HTMLSelectElement;
-            const effective = getThemePreference() || 'auto';
-            select.value = effective;
-          }
-          if (signal.aborted) return;
-          loadDiagnostics(container);
-        })();
+        void (async () => {})();
         return;
       } else {
killedBy: Settings Route ambient theme selects ambient and calls enableAmbientLightTheming
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/routes/settings.ts:283:15
         initTheme();
       } else if (theme === 'ambient') {
         void (async () => {
-          if (signal.aborted) return;
+          if (true) return;
           const ok = await enableAmbientLightTheming();
           if (signal.aborted) return;
killedBy: Settings Route ambient theme selects ambient and calls enableAmbientLightTheming
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/routes/settings.ts:283:15
         initTheme();
       } else if (theme === 'ambient') {
         void (async () => {
-          if (signal.aborted) return;
+          if (false) return;
           const ok = await enableAmbientLightTheming();
           if (signal.aborted) return;

[Survived] ConditionalExpression
src/routes/settings.ts:285:15
         void (async () => {
           if (signal.aborted) return;
           const ok = await enableAmbientLightTheming();
-          if (signal.aborted) return;
+          if (true) return;
           if (!ok) {
             // Fallback already handled inside enableAmbientLightTheming

[Survived] ConditionalExpression
src/routes/settings.ts:285:15
         void (async () => {
           if (signal.aborted) return;
           const ok = await enableAmbientLightTheming();
-          if (signal.aborted) return;
+          if (false) return;
           if (!ok) {
             // Fallback already handled inside enableAmbientLightTheming

[Survived] BooleanLiteral
src/routes/settings.ts:286:15
           if (signal.aborted) return;
           const ok = await enableAmbientLightTheming();
           if (signal.aborted) return;
-          if (!ok) {
+          if (ok) {
             // Fallback already handled inside enableAmbientLightTheming
             // Refresh select to show the effective preference

[Survived] ConditionalExpression
src/routes/settings.ts:286:15
           if (signal.aborted) return;
           const ok = await enableAmbientLightTheming();
           if (signal.aborted) return;
-          if (!ok) {
+          if (false) {
             // Fallback already handled inside enableAmbientLightTheming
             // Refresh select to show the effective preference

[NoCoverage] StringLiteral
src/routes/settings.ts:290:55
             // Fallback already handled inside enableAmbientLightTheming
             // Refresh select to show the effective preference
             const select = container.querySelector('#theme-select') as HTMLSelectElement;
-            const effective = getThemePreference() || 'auto';
+            const effective = getThemePreference() || "";
             select.value = effective;
           }

[Killed] BlockStatement
src/routes/settings.ts:297:14
           loadDiagnostics(container);
         })();
         return;
-      } else {
-        localStorage.setItem('theme-preference', theme);
-        initTheme();
-      }
+      } else {}
       loadDiagnostics(container);
     },
killedBy: Settings Route theme changes theme via select dropdown
statusReason: expected null to be 'dark' // Object.is equality

[Killed] StringLiteral
src/routes/settings.ts:298:30
         })();
         return;
       } else {
-        localStorage.setItem('theme-preference', theme);
+        localStorage.setItem("", theme);
         initTheme();
       }
killedBy: Settings Route theme changes theme via select dropdown
statusReason: expected null to be 'dark' // Object.is equality

[Killed] BlockStatement
src/routes/settings.ts:308:11
 
   container.querySelector('#export-all-btn')?.addEventListener(
     'click',
-    () => {
-      void (async () => {
-        const { exportAllGists } = await import('../services/export-import');
-        const blob = await exportAllGists();
-        const url = URL.createObjectURL(blob);
-        const a = document.createElement('a');
-        a.href = url;
-        a.download = `gists-export-${new Date().toISOString().split('T')[0]}.json`;
-        a.click();
-        URL.revokeObjectURL(url);
-        toast.success('EXPORT COMPLETE');
-      })();
-    },
+    () => {},
     { signal }
   );
killedBy: Settings Route export/import exports all gists on export button click
statusReason: expected "vi.fn()" to be called with arguments: [ 'EXPORT COMPLETE' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:309:25
   container.querySelector('#export-all-btn')?.addEventListener(
     'click',
     () => {
-      void (async () => {
-        const { exportAllGists } = await import('../services/export-import');
-        const blob = await exportAllGists();
-        const url = URL.createObjectURL(blob);
-        const a = document.createElement('a');
-        a.href = url;
-        a.download = `gists-export-${new Date().toISOString().split('T')[0]}.json`;
-        a.click();
-        URL.revokeObjectURL(url);
-        toast.success('EXPORT COMPLETE');
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: Settings Route export/import exports all gists on export button click
statusReason: expected "vi.fn()" to be called with arguments: [ 'EXPORT COMPLETE' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:326:11
 
   container.querySelector('#import-btn')?.addEventListener(
     'click',
-    () => {
-      (container.querySelector('#import-file-input') as HTMLInputElement)?.click();
-    },
+    () => {},
     { signal }
   );
killedBy: Settings Route export/import triggers file input click on import button
statusReason: expected "click" to be called at least once

[Survived] OptionalChaining
src/routes/settings.ts:327:7
   container.querySelector('#import-btn')?.addEventListener(
     'click',
     () => {
-      (container.querySelector('#import-file-input') as HTMLInputElement)?.click();
+      (container.querySelector('#import-file-input') as HTMLInputElement).click();
     },
     { signal }

[Killed] BlockStatement
src/routes/settings.ts:334:12
 
   container.querySelector('#import-file-input')?.addEventListener(
     'change',
-    (e) => {
-      void (async () => {
-        const file = (e.target as HTMLInputElement).files?.[0];
-        if (!file) return;
-
-        try {
-          const { importGists } = await import('../services/export-import');
-          const result = await importGists(file);
-          await gistStore.reloadFromDb();
-          toast.success(
-            `IMPORT COMPLETE: ${result.imported} NEW, ${result.updated} UPDATED, ${result.conflicts} CONFLICTS`
-          );
-        } catch (err) {
-          toast.error('IMPORT FAILED');
-          safeError('Import failed', err);
-        } finally {
-          (e.target as HTMLInputElement).value = '';
-        }
-      })();
-    },
+    (e) => {},
     { signal }
   );
killedBy: Settings Route export/import handles import file selection and shows result
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "IMPORT COMPLETE" ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:335:25
   container.querySelector('#import-file-input')?.addEventListener(
     'change',
     (e) => {
-      void (async () => {
-        const file = (e.target as HTMLInputElement).files?.[0];
-        if (!file) return;
-
-        try {
-          const { importGists } = await import('../services/export-import');
-          const result = await importGists(file);
-          await gistStore.reloadFromDb();
-          toast.success(
-            `IMPORT COMPLETE: ${result.imported} NEW, ${result.updated} UPDATED, ${result.conflicts} CONFLICTS`
-          );
-        } catch (err) {
-          toast.error('IMPORT FAILED');
-          safeError('Import failed', err);
-        } finally {
-          (e.target as HTMLInputElement).value = '';
-        }
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: Settings Route export/import handles import file selection and shows result
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "IMPORT COMPLETE" ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:339:13
         const file = (e.target as HTMLInputElement).files?.[0];
         if (!file) return;
 
-        try {
-          const { importGists } = await import('../services/export-import');
-          const result = await importGists(file);
-          await gistStore.reloadFromDb();
-          toast.success(
-            `IMPORT COMPLETE: ${result.imported} NEW, ${result.updated} UPDATED, ${result.conflicts} CONFLICTS`
-          );
-        } catch (err) {
+        try {} catch (err) {
           toast.error('IMPORT FAILED');
           safeError('Import failed', err);
killedBy: Settings Route export/import handles import file selection and shows result
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "IMPORT COMPLETE" ]

Number of calls: 0

[Killed] StringLiteral
src/routes/settings.ts:344:13
           const result = await importGists(file);
           await gistStore.reloadFromDb();
           toast.success(
-            `IMPORT COMPLETE: ${result.imported} NEW, ${result.updated} UPDATED, ${result.conflicts} CONFLICTS`
+            ``
           );
         } catch (err) {
killedBy: Settings Route export/import handles import file selection and shows result
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "IMPORT COMPLETE" ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "IMPORT COMPLETE",

[Killed] BlockStatement
src/routes/settings.ts:346:23
           toast.success(
             `IMPORT COMPLETE: ${result.imported} NEW, ${result.updated} UPDATED, ${result.conflicts} CONFLICTS`
           );
-        } catch (err) {
-          toast.error('IMPORT FAILED');
-          safeError('Import failed', err);
-        } finally {
+        } catch (err) {} finally {
           (e.target as HTMLInputElement).value = '';
         }
killedBy: Settings Route export/import shows error toast on import failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'IMPORT FAILED' ]

Number of calls: 0

[Survived] BlockStatement
src/routes/settings.ts:349:19
         } catch (err) {
           toast.error('IMPORT FAILED');
           safeError('Import failed', err);
-        } finally {
-          (e.target as HTMLInputElement).value = '';
-        }
+        } finally {}
       })();
     },

[Killed] BlockStatement
src/routes/settings.ts:359:11
 
   container.querySelector('#clear-cache-btn')?.addEventListener(
     'click',
-    () => {
-      void (async () => {
-        if (await showConfirmDialog('CLEAR ALL LOCAL DATA?')) {
-          const { clearAllData } = await import('../services/db');
-          await clearAllData();
-          window.location.reload();
-        }
-      })();
-    },
+    () => {},
     { signal }
   );
killedBy: Settings Route data management clears all data on clear cache button confirm
statusReason: expected "vi.fn()" to be called with arguments: [ 'CLEAR ALL LOCAL DATA?' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:360:25
   container.querySelector('#clear-cache-btn')?.addEventListener(
     'click',
     () => {
-      void (async () => {
-        if (await showConfirmDialog('CLEAR ALL LOCAL DATA?')) {
-          const { clearAllData } = await import('../services/db');
-          await clearAllData();
-          window.location.reload();
-        }
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: Settings Route data management clears all data on clear cache button confirm
statusReason: expected "vi.fn()" to be called with arguments: [ 'CLEAR ALL LOCAL DATA?' ]

Number of calls: 0

[Killed] ConditionalExpression
src/routes/settings.ts:361:13
     'click',
     () => {
       void (async () => {
-        if (await showConfirmDialog('CLEAR ALL LOCAL DATA?')) {
+        if (false) {
           const { clearAllData } = await import('../services/db');
           await clearAllData();
killedBy: Settings Route data management clears all data on clear cache button confirm
statusReason: expected "vi.fn()" to be called with arguments: [ 'CLEAR ALL LOCAL DATA?' ]

Number of calls: 0

[Killed] ConditionalExpression
src/routes/settings.ts:361:13
     'click',
     () => {
       void (async () => {
-        if (await showConfirmDialog('CLEAR ALL LOCAL DATA?')) {
+        if (true) {
           const { clearAllData } = await import('../services/db');
           await clearAllData();
killedBy: Settings Route data management clears all data on clear cache button confirm
statusReason: expected "vi.fn()" to be called with arguments: [ 'CLEAR ALL LOCAL DATA?' ]

Number of calls: 0

[Killed] StringLiteral
src/routes/settings.ts:372:5
   );
 
   container.querySelector('#export-data-btn')?.addEventListener(
-    'click',
+    "",
     () => {
       void (async () => {
killedBy: Settings Route data management exports data on export data button click
statusReason: expected "vi.fn()" to be called with arguments: [ 'DATA EXPORTED' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:373:11
 
   container.querySelector('#export-data-btn')?.addEventListener(
     'click',
-    () => {
-      void (async () => {
-        try {
-          const { exportData } = await import('../services/db');
-          const data = await exportData();
-          const blob = new Blob([data], { type: 'application/json' });
-          const url = URL.createObjectURL(blob);
-          const a = document.createElement('a');
-          a.href = url;
-          a.download = `gist-hub-backup-${new Date().toISOString().split('T')[0]}.json`;
-          document.body.appendChild(a);
-          a.click();
-          document.body.removeChild(a);
-          URL.revokeObjectURL(url);
-          toast.success('DATA EXPORTED');
-        } catch {
-          toast.error('EXPORT FAILED');
-        }
-      })();
-    },
+    () => {},
     { signal }
   );
killedBy: Settings Route data management exports data on export data button click
statusReason: expected "vi.fn()" to be called with arguments: [ 'DATA EXPORTED' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:374:25
   container.querySelector('#export-data-btn')?.addEventListener(
     'click',
     () => {
-      void (async () => {
-        try {
-          const { exportData } = await import('../services/db');
-          const data = await exportData();
-          const blob = new Blob([data], { type: 'application/json' });
-          const url = URL.createObjectURL(blob);
-          const a = document.createElement('a');
-          a.href = url;
-          a.download = `gist-hub-backup-${new Date().toISOString().split('T')[0]}.json`;
-          document.body.appendChild(a);
-          a.click();
-          document.body.removeChild(a);
-          URL.revokeObjectURL(url);
-          toast.success('DATA EXPORTED');
-        } catch {
-          toast.error('EXPORT FAILED');
-        }
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: Settings Route data management exports data on export data button click
statusReason: expected "vi.fn()" to be called with arguments: [ 'DATA EXPORTED' ]

Number of calls: 0

[Killed] BlockStatement
src/routes/settings.ts:375:13
     'click',
     () => {
       void (async () => {
-        try {
-          const { exportData } = await import('../services/db');
-          const data = await exportData();
-          const blob = new Blob([data], { type: 'application/json' });
-          const url = URL.createObjectURL(blob);
-          const a = document.createElement('a');
-          a.href = url;
-          a.download = `gist-hub-backup-${new Date().toISOString().split('T')[0]}.json`;
-          document.body.appendChild(a);
-          a.click();
-          document.body.removeChild(a);
-          URL.revokeObjectURL(url);
-          toast.success('DATA EXPORTED');
-        } catch {
+        try {} catch {
           toast.error('EXPORT FAILED');
         }
killedBy: Settings Route data management exports data on export data button click
statusReason: expected "vi.fn()" to be called with arguments: [ 'DATA EXPORTED' ]

Number of calls: 0

[Survived] StringLiteral
src/routes/settings.ts:378:49
         try {
           const { exportData } = await import('../services/db');
           const data = await exportData();
-          const blob = new Blob([data], { type: 'application/json' });
+          const blob = new Blob([data], { type: "" });
           const url = URL.createObjectURL(blob);
           const a = document.createElement('a');

[Survived] ArrayDeclaration
src/routes/settings.ts:378:33
         try {
           const { exportData } = await import('../services/db');
           const data = await exportData();
-          const blob = new Blob([data], { type: 'application/json' });
+          const blob = new Blob([], { type: 'application/json' });
           const url = URL.createObjectURL(blob);
           const a = document.createElement('a');

[NoCoverage] BlockStatement
src/routes/settings.ts:388:17
           document.body.removeChild(a);
           URL.revokeObjectURL(url);
           toast.success('DATA EXPORTED');
-        } catch {
-          toast.error('EXPORT FAILED');
-        }
+        } catch {}
       })();
     },

[NoCoverage] BlockStatement
src/routes/settings.ts:398:12
 
   container.querySelector('#accent-hue-input')?.addEventListener(
     'input',
-    (e) => {
-      const value = (e.target as HTMLInputElement).value;
-      localStorage.setItem('accent-hue', value);
-      document.documentElement.style.setProperty('--accent-h', value);
-      const display = container.querySelector('#accent-hue-value');
-      if (display) {
-        display.textContent = value;
-      }
-    },
+    (e) => {},
     { signal }
   );

[NoCoverage] StringLiteral
src/routes/settings.ts:400:28
     'input',
     (e) => {
       const value = (e.target as HTMLInputElement).value;
-      localStorage.setItem('accent-hue', value);
+      localStorage.setItem("", value);
       document.documentElement.style.setProperty('--accent-h', value);
       const display = container.querySelector('#accent-hue-value');

[NoCoverage] StringLiteral
src/routes/settings.ts:401:50
     (e) => {
       const value = (e.target as HTMLInputElement).value;
       localStorage.setItem('accent-hue', value);
-      document.documentElement.style.setProperty('--accent-h', value);
+      document.documentElement.style.setProperty("", value);
       const display = container.querySelector('#accent-hue-value');
       if (display) {

[NoCoverage] StringLiteral
src/routes/settings.ts:402:47
       const value = (e.target as HTMLInputElement).value;
       localStorage.setItem('accent-hue', value);
       document.documentElement.style.setProperty('--accent-h', value);
-      const display = container.querySelector('#accent-hue-value');
+      const display = container.querySelector("");
       if (display) {
         display.textContent = value;

[NoCoverage] BlockStatement
src/routes/settings.ts:403:20
       localStorage.setItem('accent-hue', value);
       document.documentElement.style.setProperty('--accent-h', value);
       const display = container.querySelector('#accent-hue-value');
-      if (display) {
-        display.textContent = value;
-      }
+      if (display) {}
     },
     { signal }
