[Killed] ConditionalExpression
src/components/gist-card.ts:195:15
 
         const card = target.closest('.gist-card') as HTMLElement;
         if (card && onCardClick) {
-          if (target.closest('.gist-card-actions')) return;
+          if (false) return;
           const id = card.getAttribute('data-gist-id');
           if (id) onCardClick(id);
killedBy: Gist Card bindCardEvents does not call onCardClick when clicking in card actions footer
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "footer-test",

[Survived] StringLiteral
src/components/gist-card.ts:208:5
 
   // Reset eventsBound when the signal aborts so future mounts can rebind
   signal?.addEventListener(
-    'abort',
+    "",
     () => {
       delete container.dataset.eventsBound;

[NoCoverage] BlockStatement
src/components/gist-card.ts:209:11
   // Reset eventsBound when the signal aborts so future mounts can rebind
   signal?.addEventListener(
     'abort',
-    () => {
-      delete container.dataset.eventsBound;
-    },
+    () => {},
     { once: true }
   );

[Survived] BooleanLiteral
src/components/gist-card.ts:212:13
     () => {
       delete container.dataset.eventsBound;
     },
-    { once: true }
+    { once: false }
   );
 }
