[Survived] ArithmeticOperator
src/components/gist-detail.ts:17:18
 function formatRelativeTime(dateStr: string): string {
   const now = new Date();
   const date = new Date(dateStr);
-  const diffMs = now.getTime() - date.getTime();
+  const diffMs = now.getTime() + date.getTime();
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'Just now';

[Survived] ArithmeticOperator
src/components/gist-detail.ts:18:30
   const now = new Date();
   const date = new Date(dateStr);
   const diffMs = now.getTime() - date.getTime();
-  const diffSec = Math.floor(diffMs / 1000);
+  const diffSec = Math.floor(diffMs * 1000);
   if (diffSec < 60) return 'Just now';
   const diffMin = Math.floor(diffSec / 60);

[Survived] ConditionalExpression
src/components/gist-detail.ts:19:7
   const date = new Date(dateStr);
   const diffMs = now.getTime() - date.getTime();
   const diffSec = Math.floor(diffMs / 1000);
-  if (diffSec < 60) return 'Just now';
+  if (false) return 'Just now';
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}m ago`;

[Survived] ConditionalExpression
src/components/gist-detail.ts:19:7
   const date = new Date(dateStr);
   const diffMs = now.getTime() - date.getTime();
   const diffSec = Math.floor(diffMs / 1000);
-  if (diffSec < 60) return 'Just now';
+  if (true) return 'Just now';
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}m ago`;

[Survived] ArithmeticOperator
src/components/gist-detail.ts:20:30
   const diffMs = now.getTime() - date.getTime();
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'Just now';
-  const diffMin = Math.floor(diffSec / 60);
+  const diffMin = Math.floor(diffSec * 60);
   if (diffMin < 60) return `${diffMin}m ago`;
   const diffHr = Math.floor(diffMin / 60);

[Survived] EqualityOperator
src/components/gist-detail.ts:21:7
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'Just now';
   const diffMin = Math.floor(diffSec / 60);
-  if (diffMin < 60) return `${diffMin}m ago`;
+  if (diffMin <= 60) return `${diffMin}m ago`;
   const diffHr = Math.floor(diffMin / 60);
   if (diffHr < 24) return `${diffHr}h ago`;

[Survived] ConditionalExpression
src/components/gist-detail.ts:21:7
   const diffSec = Math.floor(diffMs / 1000);
   if (diffSec < 60) return 'Just now';
   const diffMin = Math.floor(diffSec / 60);
-  if (diffMin < 60) return `${diffMin}m ago`;
+  if (true) return `${diffMin}m ago`;
   const diffHr = Math.floor(diffMin / 60);
   if (diffHr < 24) return `${diffHr}h ago`;

[Survived] ArithmeticOperator
src/components/gist-detail.ts:22:29
   if (diffSec < 60) return 'Just now';
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}m ago`;
-  const diffHr = Math.floor(diffMin / 60);
+  const diffHr = Math.floor(diffMin * 60);
   if (diffHr < 24) return `${diffHr}h ago`;
   const diffDay = Math.floor(diffHr / 24);

[Survived] ConditionalExpression
src/components/gist-detail.ts:23:7
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}m ago`;
   const diffHr = Math.floor(diffMin / 60);
-  if (diffHr < 24) return `${diffHr}h ago`;
+  if (true) return `${diffHr}h ago`;
   const diffDay = Math.floor(diffHr / 24);
   return `${diffDay}d ago`;

[Survived] EqualityOperator
src/components/gist-detail.ts:23:7
   const diffMin = Math.floor(diffSec / 60);
   if (diffMin < 60) return `${diffMin}m ago`;
   const diffHr = Math.floor(diffMin / 60);
-  if (diffHr < 24) return `${diffHr}h ago`;
+  if (diffHr <= 24) return `${diffHr}h ago`;
   const diffDay = Math.floor(diffHr / 24);
   return `${diffDay}d ago`;

[Survived] ArithmeticOperator
src/components/gist-detail.ts:24:30
   if (diffMin < 60) return `${diffMin}m ago`;
   const diffHr = Math.floor(diffMin / 60);
   if (diffHr < 24) return `${diffHr}h ago`;
-  const diffDay = Math.floor(diffHr / 24);
+  const diffDay = Math.floor(diffHr * 24);
   return `${diffDay}d ago`;
 }

[Killed] StringLiteral
src/components/gist-detail.ts:33:37
 }
 
 export function renderGistDetail(gist: GistRecord): string {
-  const title = gist.description || 'Untitled Gist';
+  const title = gist.description || "";
   const fileCount = Object.keys(gist.files).length;
   const visibility = gist.public ? 'Public' : 'Secret';
killedBy: GistDetail renderGistDetail shows Untitled Gist when description is empty
statusReason: expected '\n    <div class="gist-detail" data-g…' to contain 'Untitled Gist'

[Killed] EqualityOperator
src/components/gist-detail.ts:38:5
   const visibility = gist.public ? 'Public' : 'Secret';
 
   const fileTabs =
-    fileCount > 1
+    fileCount <= 1
       ? `
     <div class="file-tabs scroll-x" role="tablist">
killedBy: GistDetail renderGistDetail renders file tabs for multi-file gists
statusReason: expected '\n    <div class="gist-detail" data-g…' to contain 'file-tabs'

[Killed] ConditionalExpression
src/components/gist-detail.ts:38:5
   const visibility = gist.public ? 'Public' : 'Secret';
 
   const fileTabs =
-    fileCount > 1
+    false
       ? `
     <div class="file-tabs scroll-x" role="tablist">
killedBy: GistDetail renderGistDetail renders file tabs for multi-file gists
statusReason: expected '\n    <div class="gist-detail" data-g…' to contain 'file-tabs'

[Killed] ArrowFunction
src/components/gist-detail.ts:43:11
     <div class="file-tabs scroll-x" role="tablist">
       ${Object.entries(gist.files)
         .map(
-          ([key, file], index) => `
-        <button class="chip file-tab ${index === 0 ? 'active' : ''}" data-file-key="${sanitizeHtml(key)}" id="tab-${index}" role="tab" aria-selected="${index === 0}" aria-controls="file-content-area">
-          ${sanitizeHtml(file.filename.toUpperCase())}
-        </button>
-      `
+          () => undefined
         )
         .join('')}
killedBy: GistDetail renderGistDetail renders file tabs for multi-file gists
statusReason: expected '\n    <div class="gist-detail" data-g…' to contain 'TEST.TS'

[Survived] ConditionalExpression
src/components/gist-detail.ts:44:153
       ${Object.entries(gist.files)
         .map(
           ([key, file], index) => `
-        <button class="chip file-tab ${index === 0 ? 'active' : ''}" data-file-key="${sanitizeHtml(key)}" id="tab-${index}" role="tab" aria-selected="${index === 0}" aria-controls="file-content-area">
+        <button class="chip file-tab ${index === 0 ? 'active' : ''}" data-file-key="${sanitizeHtml(key)}" id="tab-${index}" role="tab" aria-selected="${true}" aria-controls="file-content-area">
           ${sanitizeHtml(file.filename.toUpperCase())}
         </button>

[Survived] ConditionalExpression
src/components/gist-detail.ts:44:153
       ${Object.entries(gist.files)
         .map(
           ([key, file], index) => `
-        <button class="chip file-tab ${index === 0 ? 'active' : ''}" data-file-key="${sanitizeHtml(key)}" id="tab-${index}" role="tab" aria-selected="${index === 0}" aria-controls="file-content-area">
+        <button class="chip file-tab ${index === 0 ? 'active' : ''}" data-file-key="${sanitizeHtml(key)}" id="tab-${index}" role="tab" aria-selected="${false}" aria-controls="file-content-area">
           ${sanitizeHtml(file.filename.toUpperCase())}
         </button>

[Killed] MethodExpression
src/components/gist-detail.ts:45:26
         .map(
           ([key, file], index) => `
         <button class="chip file-tab ${index === 0 ? 'active' : ''}" data-file-key="${sanitizeHtml(key)}" id="tab-${index}" role="tab" aria-selected="${index === 0}" aria-controls="file-content-area">
-          ${sanitizeHtml(file.filename.toUpperCase())}
+          ${sanitizeHtml(file.filename.toLowerCase())}
         </button>
       `
killedBy: GistDetail renderGistDetail renders file tabs for multi-file gists
statusReason: expected '\n    <div class="gist-detail" data-g…' to contain 'TEST.TS'

[NoCoverage] StringLiteral
src/components/gist-detail.ts:96:92
             ? `
           <div class="file-info-left">
             <span class="micro-label">Language: ${sanitizeHtml(firstFile.language || 'Unknown')}</span>
-            <span class="micro-label">Raw URL: <a href="${sanitizeHtml(firstFile.rawUrl || '')}" target="_blank" rel="noopener noreferrer">Link</a></span>
+            <span class="micro-label">Raw URL: <a href="${sanitizeHtml(firstFile.rawUrl || "Stryker was here!")}" target="_blank" rel="noopener noreferrer">Link</a></span>
           </div>
           <button class="btn btn-ghost btn-copy-sm" data-action="copy-content" aria-label="Copy file content">

[Killed] BlockStatement
src/components/gist-detail.ts:116:18
   onEdit: (id: string) => void,
   onViewRevision: (id: string, version: string) => void,
   signal?: AbortSignal
-): Promise<void> {
-  try {
-    const gist = await gistStore.hydrateGist(id);
-    if (signal?.aborted) return;
-    if (!gist) {
-      throw new Error('Gist not found');
-    }
-    container.innerHTML = renderGistDetail(gist);
-    bindDetailEvents(container, { onBack, onEdit, onViewRevision }, signal);
-  } catch (err) {
-    safeError('[GistDetail] Failed to load gist', err);
-    toast.error('Failed to load gist details');
-  }
-}
+): Promise<void> {}
 
 export function renderRevisions(gistId: string, revisions: GistRevision[]): string {
killedBy: GistDetail loadGistDetail renders gist detail and shows error when gist not found
statusReason: expected "vi.fn()" to be called with arguments: [ 'non-existent' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-detail.ts:117:7
   onViewRevision: (id: string, version: string) => void,
   signal?: AbortSignal
 ): Promise<void> {
-  try {
-    const gist = await gistStore.hydrateGist(id);
-    if (signal?.aborted) return;
-    if (!gist) {
-      throw new Error('Gist not found');
-    }
-    container.innerHTML = renderGistDetail(gist);
-    bindDetailEvents(container, { onBack, onEdit, onViewRevision }, signal);
-  } catch (err) {
+  try {} catch (err) {
     safeError('[GistDetail] Failed to load gist', err);
     toast.error('Failed to load gist details');
killedBy: GistDetail loadGistDetail renders gist detail and shows error when gist not found
statusReason: expected "vi.fn()" to be called with arguments: [ 'non-existent' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-detail.ts:119:9
 ): Promise<void> {
   try {
     const gist = await gistStore.hydrateGist(id);
-    if (signal?.aborted) return;
+    if (false) return;
     if (!gist) {
       throw new Error('Gist not found');

[Survived] BlockStatement
src/components/gist-detail.ts:125:17
     }
     container.innerHTML = renderGistDetail(gist);
     bindDetailEvents(container, { onBack, onEdit, onViewRevision }, signal);
-  } catch (err) {
-    safeError('[GistDetail] Failed to load gist', err);
-    toast.error('Failed to load gist details');
-  }
+  } catch (err) {}
 }
 

[Killed] BlockStatement
src/components/gist-detail.ts:133:19
 
 export function renderRevisions(gistId: string, revisions: GistRevision[]): string {
   const revisionsHtml = revisions
-    .map((rev) => {
-      const date = new Date(rev.committed_at).toLocaleString();
-      return `
-      <div class="revision-item glass-card" data-version="${sanitizeHtml(rev.version)}">
-        <div class="revision-meta">
-          <span class="stat-number">${date}</span>
-          <span class="micro-label">By ${sanitizeHtml(rev.user?.login || 'Unknown')}</span>
-        </div>
-        <button class="btn btn-ghost btn-sm" data-action="view-revision" data-version="${sanitizeHtml(rev.version)}">View</button>
-      </div>
-    `;
-    })
+    .map((rev) => {})
     .join('');
 
killedBy: GistDetail renderRevisions renders revision list with back button
statusReason: expected '\n    <div class="revisions-list" dat…' to contain 'data-action="view-revision"'

[Killed] StringLiteral
src/components/gist-detail.ts:135:14
   const revisionsHtml = revisions
     .map((rev) => {
       const date = new Date(rev.committed_at).toLocaleString();
-      return `
-      <div class="revision-item glass-card" data-version="${sanitizeHtml(rev.version)}">
-        <div class="revision-meta">
-          <span class="stat-number">${date}</span>
-          <span class="micro-label">By ${sanitizeHtml(rev.user?.login || 'Unknown')}</span>
-        </div>
-        <button class="btn btn-ghost btn-sm" data-action="view-revision" data-version="${sanitizeHtml(rev.version)}">View</button>
-      </div>
-    `;
+      return ``;
     })
     .join('');
killedBy: GistDetail renderRevisions renders revision list with back button
statusReason: expected '\n    <div class="revisions-list" dat…' to contain 'data-action="view-revision"'

[Killed] LogicalOperator
src/components/gist-detail.ts:139:55
       <div class="revision-item glass-card" data-version="${sanitizeHtml(rev.version)}">
         <div class="revision-meta">
           <span class="stat-number">${date}</span>
-          <span class="micro-label">By ${sanitizeHtml(rev.user?.login || 'Unknown')}</span>
+          <span class="micro-label">By ${sanitizeHtml(rev.user?.login && 'Unknown')}</span>
         </div>
         <button class="btn btn-ghost btn-sm" data-action="view-revision" data-version="${sanitizeHtml(rev.version)}">View</button>
killedBy: GistDetail renderRevisions renders each revision with user and date
statusReason: expected '\n    <div class="revisions-list" dat…' to contain 'user1'

[Survived] OptionalChaining
src/components/gist-detail.ts:139:55
       <div class="revision-item glass-card" data-version="${sanitizeHtml(rev.version)}">
         <div class="revision-meta">
           <span class="stat-number">${date}</span>
-          <span class="micro-label">By ${sanitizeHtml(rev.user?.login || 'Unknown')}</span>
+          <span class="micro-label">By ${sanitizeHtml(rev.user.login || 'Unknown')}</span>
         </div>
         <button class="btn btn-ghost btn-sm" data-action="view-revision" data-version="${sanitizeHtml(rev.version)}">View</button>

[Killed] StringLiteral
src/components/gist-detail.ts:171:42
   },
   signal?: AbortSignal
 ): void {
-  const gistId = container.querySelector('.gist-detail')?.getAttribute('data-gist-id');
+  const gistId = container.querySelector("")?.getAttribute('data-gist-id');
   container.querySelector('#gist-back-btn')?.addEventListener('click', onBack, { signal });
   container.querySelector('[data-action="edit"]')?.addEventListener(
killedBy: GistDetail bindDetailEvents calls onBack when back button is clicked
statusReason: Invalid selector

[Killed] StringLiteral
src/components/gist-detail.ts:171:72
   },
   signal?: AbortSignal
 ): void {
-  const gistId = container.querySelector('.gist-detail')?.getAttribute('data-gist-id');
+  const gistId = container.querySelector('.gist-detail')?.getAttribute("");
   container.querySelector('#gist-back-btn')?.addEventListener('click', onBack, { signal });
   container.querySelector('[data-action="edit"]')?.addEventListener(
killedBy: GistDetail bindDetailEvents calls onEdit with gistId when edit button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Killed] StringLiteral
src/components/gist-detail.ts:172:27
   signal?: AbortSignal
 ): void {
   const gistId = container.querySelector('.gist-detail')?.getAttribute('data-gist-id');
-  container.querySelector('#gist-back-btn')?.addEventListener('click', onBack, { signal });
+  container.querySelector("")?.addEventListener('click', onBack, { signal });
   container.querySelector('[data-action="edit"]')?.addEventListener(
     'click',
killedBy: GistDetail bindDetailEvents calls onBack when back button is clicked
statusReason: Invalid selector

[Killed] StringLiteral
src/components/gist-detail.ts:172:63
   signal?: AbortSignal
 ): void {
   const gistId = container.querySelector('.gist-detail')?.getAttribute('data-gist-id');
-  container.querySelector('#gist-back-btn')?.addEventListener('click', onBack, { signal });
+  container.querySelector('#gist-back-btn')?.addEventListener("", onBack, { signal });
   container.querySelector('[data-action="edit"]')?.addEventListener(
     'click',
killedBy: GistDetail bindDetailEvents calls onBack when back button is clicked
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/components/gist-detail.ts:175:11
   container.querySelector('#gist-back-btn')?.addEventListener('click', onBack, { signal });
   container.querySelector('[data-action="edit"]')?.addEventListener(
     'click',
-    () => {
-      if (gistId) onEdit(gistId);
-    },
+    () => {},
     { signal }
   );
killedBy: GistDetail bindDetailEvents calls onEdit with gistId when edit button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Survived] ObjectLiteral
src/components/gist-detail.ts:178:5
     () => {
       if (gistId) onEdit(gistId);
     },
-    { signal }
+    {}
   );
 

[Killed] BlockStatement
src/components/gist-detail.ts:183:11
 
   container.querySelector('[data-action="revisions"]')?.addEventListener(
     'click',
-    () => {
-      void (async () => {
-        if (!gistId) return;
-        try {
-          const revisions = await GitHub.listGistRevisions(gistId);
-          if (signal?.aborted) return;
-          container.innerHTML = renderRevisions(gistId, revisions);
-          bindRevisionEvents(
-            container,
-            {
-              onBack: () =>
-                void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal),
-              onViewRevision,
-            },
-            signal
-          );
-        } catch {
-          toast.error('Failed to load revisions');
-        }
-      })();
-    },
+    () => {},
     { signal }
   );
killedBy: GistDetail bindDetailEvents loads revisions when revisions button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-detail.ts:184:25
   container.querySelector('[data-action="revisions"]')?.addEventListener(
     'click',
     () => {
-      void (async () => {
-        if (!gistId) return;
-        try {
-          const revisions = await GitHub.listGistRevisions(gistId);
-          if (signal?.aborted) return;
-          container.innerHTML = renderRevisions(gistId, revisions);
-          bindRevisionEvents(
-            container,
-            {
-              onBack: () =>
-                void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal),
-              onViewRevision,
-            },
-            signal
-          );
-        } catch {
-          toast.error('Failed to load revisions');
-        }
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: GistDetail bindDetailEvents loads revisions when revisions button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-detail.ts:186:13
     () => {
       void (async () => {
         if (!gistId) return;
-        try {
-          const revisions = await GitHub.listGistRevisions(gistId);
-          if (signal?.aborted) return;
-          container.innerHTML = renderRevisions(gistId, revisions);
-          bindRevisionEvents(
-            container,
-            {
-              onBack: () =>
-                void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal),
-              onViewRevision,
-            },
-            signal
-          );
-        } catch {
+        try {} catch {
           toast.error('Failed to load revisions');
         }
killedBy: GistDetail bindDetailEvents loads revisions when revisions button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-detail.ts:188:15
         if (!gistId) return;
         try {
           const revisions = await GitHub.listGistRevisions(gistId);
-          if (signal?.aborted) return;
+          if (false) return;
           container.innerHTML = renderRevisions(gistId, revisions);
           bindRevisionEvents(

[Survived] ArrowFunction
src/components/gist-detail.ts:193:23
           bindRevisionEvents(
             container,
             {
-              onBack: () =>
-                void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal),
+              onBack: () => undefined,
               onViewRevision,
             },

[NoCoverage] BlockStatement
src/components/gist-detail.ts:199:17
             },
             signal
           );
-        } catch {
-          toast.error('Failed to load revisions');
-        }
+        } catch {}
       })();
     },

[Killed] StringLiteral
src/components/gist-detail.ts:208:27
   );
 
   // Star button
-  container.querySelector('[data-action="star"]')?.addEventListener(
+  container.querySelector("")?.addEventListener(
     'click',
     () => {
killedBy: GistDetail bindDetailEvents calls onBack when back button is clicked
statusReason: Invalid selector

[Killed] StringLiteral
src/components/gist-detail.ts:209:5
 
   // Star button
   container.querySelector('[data-action="star"]')?.addEventListener(
-    'click',
+    "",
     () => {
       void (async () => {
killedBy: GistDetail bindDetailEvents calls toggleStar when star button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-detail.ts:210:11
   // Star button
   container.querySelector('[data-action="star"]')?.addEventListener(
     'click',
-    () => {
-      void (async () => {
-        if (!gistId) return;
-        const ok = await (await import('../stores/gist-store')).default.toggleStar(gistId);
-        if (signal?.aborted) return;
-        if (ok) void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal);
-      })();
-    },
+    () => {},
     { signal }
   );
killedBy: GistDetail bindDetailEvents calls toggleStar when star button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Killed] BlockStatement
src/components/gist-detail.ts:211:25
   container.querySelector('[data-action="star"]')?.addEventListener(
     'click',
     () => {
-      void (async () => {
-        if (!gistId) return;
-        const ok = await (await import('../stores/gist-store')).default.toggleStar(gistId);
-        if (signal?.aborted) return;
-        if (ok) void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal);
-      })();
+      void (async () => {})();
     },
     { signal }
killedBy: GistDetail bindDetailEvents calls toggleStar when star button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-detail.ts:214:13
       void (async () => {
         if (!gistId) return;
         const ok = await (await import('../stores/gist-store')).default.toggleStar(gistId);
-        if (signal?.aborted) return;
+        if (false) return;
         if (ok) void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal);
       })();

[Survived] ConditionalExpression
src/components/gist-detail.ts:215:13
         if (!gistId) return;
         const ok = await (await import('../stores/gist-store')).default.toggleStar(gistId);
         if (signal?.aborted) return;
-        if (ok) void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal);
+        if (true) void loadGistDetail(gistId, container, onBack, onEdit, onViewRevision, signal);
       })();
     },

[Killed] BlockStatement
src/components/gist-detail.ts:231:29
         if (!fileKey) return;
 
         // Update active tab UI
-        tabs.forEach((t) => {
-          t.classList.remove('active');
-          t.setAttribute('aria-selected', 'false');
-        });
+        tabs.forEach((t) => {});
         tab.classList.add('active');
         tab.setAttribute('aria-selected', 'true');
killedBy: GistDetail bindDetailEvents switches file content when a file tab is clicked
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] StringLiteral
src/components/gist-detail.ts:235:27
           t.classList.remove('active');
           t.setAttribute('aria-selected', 'false');
         });
-        tab.classList.add('active');
+        tab.classList.add("");
         tab.setAttribute('aria-selected', 'true');
 
killedBy: GistDetail bindDetailEvents switches file content when a file tab is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'gist-1' ]

Number of calls: 0

[Killed] StringLiteral
src/components/gist-detail.ts:236:43
           t.setAttribute('aria-selected', 'false');
         });
         tab.classList.add('active');
-        tab.setAttribute('aria-selected', 'true');
+        tab.setAttribute('aria-selected', "");
 
         // Update content
killedBy: GistDetail bindDetailEvents switches file content when a file tab is clicked
statusReason: expected '' to be 'true' // Object.is equality

[Survived] ConditionalExpression
src/components/gist-detail.ts:242:15
         void (async () => {
           if (!gistId) return;
           const gist = await (await import('../stores/gist-store')).default.getGist(gistId);
-          if (signal?.aborted) return;
+          if (false) return;
           if (!gist) return;
           const file = gist.files[fileKey];

[Survived] BlockStatement
src/components/gist-detail.ts:248:28
           if (!file) return;
 
           const contentArea = container.querySelector('#file-content-area');
-          if (contentArea) {
-            contentArea.innerHTML = renderFileContent(file.content || '', file.language);
-            contentArea.setAttribute('aria-labelledby', tab.id);
-          }
+          if (contentArea) {}
 
           const infoArea = container.querySelector('#file-info');

[Survived] BlockStatement
src/components/gist-detail.ts:254:25
           }
 
           const infoArea = container.querySelector('#file-info');
-          if (infoArea) {
-            infoArea.innerHTML = `
-            <div class="file-info-left">
-              <span class="micro-label">Language: ${sanitizeHtml(file.language || 'Unknown')}</span>
-              <span class="micro-label">Raw URL: <a href="${sanitizeHtml(file.rawUrl || '')}" target="_blank" rel="noopener noreferrer">Link</a></span>
-            </div>
-            <button class="btn btn-ghost btn-copy-sm" data-action="copy-content" aria-label="Copy file content">
-              <span class="micro-label">COPY</span>
-            </button>
-          `;
-          }
+          if (infoArea) {}
         })();
       },

[NoCoverage] StringLiteral
src/components/gist-detail.ts:258:89
             infoArea.innerHTML = `
             <div class="file-info-left">
               <span class="micro-label">Language: ${sanitizeHtml(file.language || 'Unknown')}</span>
-              <span class="micro-label">Raw URL: <a href="${sanitizeHtml(file.rawUrl || '')}" target="_blank" rel="noopener noreferrer">Link</a></span>
+              <span class="micro-label">Raw URL: <a href="${sanitizeHtml(file.rawUrl || "Stryker was here!")}" target="_blank" rel="noopener noreferrer">Link</a></span>
             </div>
             <button class="btn btn-ghost btn-copy-sm" data-action="copy-content" aria-label="Copy file content">

[Killed] EqualityOperator
src/components/gist-detail.ts:272:7
   });
 
   // Copy Content
-  if (container.dataset.copyBound !== 'true') {
+  if (container.dataset.copyBound === 'true') {
     container.addEventListener(
       'click',
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/gist-detail.ts:272:7
   });
 
   // Copy Content
-  if (container.dataset.copyBound !== 'true') {
+  if (false) {
     container.addEventListener(
       'click',
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/gist-detail.ts:279:13
         const copyBtn = (e.target as HTMLElement).closest(
           '[data-action="copy-content"]'
         ) as HTMLElement;
-        if (!copyBtn || copyBtn.classList.contains('btn-success')) return;
+        if (true) return;
 
         void (async () => {
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-detail.ts:279:13
         const copyBtn = (e.target as HTMLElement).closest(
           '[data-action="copy-content"]'
         ) as HTMLElement;
-        if (!copyBtn || copyBtn.classList.contains('btn-success')) return;
+        if (false) return;
 
         void (async () => {

[Killed] StringLiteral
src/components/gist-detail.ts:282:55
         if (!copyBtn || copyBtn.classList.contains('btn-success')) return;
 
         void (async () => {
-          const contentArea = container.querySelector('#file-content-area code');
+          const contentArea = container.querySelector("");
           if (!contentArea) return;
 
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Number of calls: 0
