[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:23:7
 const DEFAULT_PROXY_URL = 'https://auth-proxy.d-o-gist-hub.workers.dev';
 
 function getProxyUrl(): string {
-  if (typeof window !== 'undefined') {
+  if (true) {
     const win = window as { __AUTH_PROXY_URL?: string };
     if (win.__AUTH_PROXY_URL) return win.__AUTH_PROXY_URL;

[NoCoverage] EqualityOperator
src/services/github/device-flow.ts:23:7
 const DEFAULT_PROXY_URL = 'https://auth-proxy.d-o-gist-hub.workers.dev';
 
 function getProxyUrl(): string {
-  if (typeof window !== 'undefined') {
+  if (typeof window === 'undefined') {
     const win = window as { __AUTH_PROXY_URL?: string };
     if (win.__AUTH_PROXY_URL) return win.__AUTH_PROXY_URL;

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:56:32
  */
 export async function requestDeviceCode(): Promise<DeviceCode> {
   const proxyUrl = getProxyUrl();
-  const response = await fetch(`${proxyUrl}/login/device/code`, {
+  const response = await fetch(``, {
     method: 'POST',
     headers: { 'Content-Type': 'application/json' },

[NoCoverage] ObjectLiteral
src/services/github/device-flow.ts:56:65
  */
 export async function requestDeviceCode(): Promise<DeviceCode> {
   const proxyUrl = getProxyUrl();
-  const response = await fetch(`${proxyUrl}/login/device/code`, {
-    method: 'POST',
-    headers: { 'Content-Type': 'application/json' },
-  });
+  const response = await fetch(`${proxyUrl}/login/device/code`, {});
 
   if (!response.ok) {

[NoCoverage] BlockStatement
src/services/github/device-flow.ts:61:21
     headers: { 'Content-Type': 'application/json' },
   });
 
-  if (!response.ok) {
-    const errBody = await response.text();
-    throw new Error(`Failed to request device code: ${response.status} ${errBody}`);
-  }
+  if (!response.ok) {}
 
   const data = await response.json();

[NoCoverage] BlockStatement
src/services/github/device-flow.ts:68:19
 
   const data = await response.json();
 
-  if (data.error) {
-    throw new Error(data.error_description || data.error);
-  }
+  if (data.error) {}
 
   return {

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:68:7
 
   const data = await response.json();
 
-  if (data.error) {
+  if (false) {
     throw new Error(data.error_description || data.error);
   }

[NoCoverage] LogicalOperator
src/services/github/device-flow.ts:69:21
   const data = await response.json();
 
   if (data.error) {
-    throw new Error(data.error_description || data.error);
+    throw new Error(data.error_description && data.error);
   }
 

[NoCoverage] LogicalOperator
src/services/github/device-flow.ts:76:15
     deviceCode: data.device_code,
     userCode: data.user_code,
     verificationUri: data.verification_uri,
-    interval: data.interval || 5,
+    interval: data.interval && 5,
     expiresIn: data.expires_in || 900,
   };

[NoCoverage] LogicalOperator
src/services/github/device-flow.ts:77:16
     userCode: data.user_code,
     verificationUri: data.verification_uri,
     interval: data.interval || 5,
-    expiresIn: data.expires_in || 900,
+    expiresIn: data.expires_in && 900,
   };
 }

[NoCoverage] ArithmeticOperator
src/services/github/device-flow.ts:100:21
 ): Promise<DeviceFlowResult> {
   const proxyUrl = getProxyUrl();
   const startTime = Date.now();
-  const timeoutMs = expiresIn * 1000;
+  const timeoutMs = expiresIn / 1000;
   const pollIntervalMs = interval * 1000;
 

[NoCoverage] ArithmeticOperator
src/services/github/device-flow.ts:101:26
   const proxyUrl = getProxyUrl();
   const startTime = Date.now();
   const timeoutMs = expiresIn * 1000;
-  const pollIntervalMs = interval * 1000;
+  const pollIntervalMs = interval / 1000;
 
   onProgress?.('Waiting for authentication...');

[NoCoverage] ArithmeticOperator
src/services/github/device-flow.ts:105:10
 
   onProgress?.('Waiting for authentication...');
 
-  while (Date.now() - startTime < timeoutMs) {
+  while (Date.now() + startTime < timeoutMs) {
     // Wait for the polling interval
     await delay(pollIntervalMs);

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:110:36
     await delay(pollIntervalMs);
 
     try {
-      const response = await fetch(`${proxyUrl}/login/oauth/access_token`, {
+      const response = await fetch(``, {
         method: 'POST',
         headers: { 'Content-Type': 'application/json' },

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:111:17
 
     try {
       const response = await fetch(`${proxyUrl}/login/oauth/access_token`, {
-        method: 'POST',
+        method: "",
         headers: { 'Content-Type': 'application/json' },
         body: JSON.stringify({ device_code: deviceCode }),

[NoCoverage] ObjectLiteral
src/services/github/device-flow.ts:113:30
       const response = await fetch(`${proxyUrl}/login/oauth/access_token`, {
         method: 'POST',
         headers: { 'Content-Type': 'application/json' },
-        body: JSON.stringify({ device_code: deviceCode }),
+        body: JSON.stringify({}),
       });
 

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:127:11
       const data = await response.json();
 
       // Success — token received
-      if (data.access_token) {
+      if (false) {
         return {
           success: true,

[NoCoverage] BlockStatement
src/services/github/device-flow.ts:127:30
       const data = await response.json();
 
       // Success — token received
-      if (data.access_token) {
-        return {
-          success: true,
-          accessToken: data.access_token,
-        };
-      }
+      if (data.access_token) {}
 
       // Handle polling errors

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:135:11
       }
 
       // Handle polling errors
-      if (data.error) {
+      if (false) {
         switch (data.error) {
           case 'authorization_pending':

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:135:11
       }
 
       // Handle polling errors
-      if (data.error) {
+      if (true) {
         switch (data.error) {
           case 'authorization_pending':

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:137:11
       // Handle polling errors
       if (data.error) {
         switch (data.error) {
-          case 'authorization_pending':
-            // Normal — user hasn't completed auth yet
-            onProgress?.('Waiting for authentication...');
-            break;
+          case 'authorization_pending':
           case 'slow_down':
             // GitHub asks us to slow down — increase interval by 5s

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:141:11
             // Normal — user hasn't completed auth yet
             onProgress?.('Waiting for authentication...');
             break;
-          case 'slow_down':
-            // GitHub asks us to slow down — increase interval by 5s
-            onProgress?.('Slowing down polling...');
-            await delay(pollIntervalMs * 2);
-            break;
+          case 'slow_down':
           case 'expired_token':
             return {

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:141:16
             // Normal — user hasn't completed auth yet
             onProgress?.('Waiting for authentication...');
             break;
-          case 'slow_down':
+          case "":
             // GitHub asks us to slow down — increase interval by 5s
             onProgress?.('Slowing down polling...');

[NoCoverage] ArithmeticOperator
src/services/github/device-flow.ts:144:25
           case 'slow_down':
             // GitHub asks us to slow down — increase interval by 5s
             onProgress?.('Slowing down polling...');
-            await delay(pollIntervalMs * 2);
+            await delay(pollIntervalMs / 2);
             break;
           case 'expired_token':

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:146:11
             onProgress?.('Slowing down polling...');
             await delay(pollIntervalMs * 2);
             break;
-          case 'expired_token':
-            return {
-              success: false,
-              error: 'expired_token',
-              errorDescription: 'The device code expired. Please try again.',
-            };
+          case 'expired_token':
           case 'access_denied':
             return {

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:150:33
             return {
               success: false,
               error: 'expired_token',
-              errorDescription: 'The device code expired. Please try again.',
+              errorDescription: "",
             };
           case 'access_denied':

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:152:11
               error: 'expired_token',
               errorDescription: 'The device code expired. Please try again.',
             };
-          case 'access_denied':
-            return {
-              success: false,
-              error: 'access_denied',
-              errorDescription: 'You denied the authorization request.',
-            };
+          case 'access_denied':
           default:
             return {

[NoCoverage] ConditionalExpression
src/services/github/device-flow.ts:158:11
               error: 'access_denied',
               errorDescription: 'You denied the authorization request.',
             };
-          default:
-            return {
-              success: false,
-              error: data.error,
-              errorDescription: data.error_description || 'Unknown error during polling',
-            };
+          default:
         }
       }

[NoCoverage] LogicalOperator
src/services/github/device-flow.ts:162:33
             return {
               success: false,
               error: data.error,
-              errorDescription: data.error_description || 'Unknown error during polling',
+              errorDescription: data.error_description && 'Unknown error during polling',
             };
         }

[NoCoverage] BlockStatement
src/services/github/device-flow.ts:166:19
             };
         }
       }
-    } catch (err) {
-      return {
-        success: false,
-        error: 'network_error',
-        errorDescription: err instanceof Error ? err.message : 'Network error during polling',
-      };
-    }
+    } catch (err) {}
   }
 

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:169:16
     } catch (err) {
       return {
         success: false,
-        error: 'network_error',
+        error: "",
         errorDescription: err instanceof Error ? err.message : 'Network error during polling',
       };

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:170:64
       return {
         success: false,
         error: 'network_error',
-        errorDescription: err instanceof Error ? err.message : 'Network error during polling',
+        errorDescription: err instanceof Error ? err.message : "",
       };
     }

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:177:12
 
   return {
     success: false,
-    error: 'timeout',
+    error: "",
     errorDescription: 'Authentication timed out. Please try again.',
   };

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:178:23
   return {
     success: false,
     error: 'timeout',
-    errorDescription: 'Authentication timed out. Please try again.',
+    errorDescription: "",
   };
 }

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:199:18
     // Step 1: Request device code
     const code = await requestDeviceCode();
 
-    onProgress?.(`Visit ${code.verificationUri} and enter code: ${code.userCode}`);
+    onProgress?.(``);
 
     // Step 2: Poll for token

[NoCoverage] BooleanLiteral
src/services/github/device-flow.ts:204:9
     // Step 2: Poll for token
     const result = await pollForToken(code.deviceCode, code.expiresIn, code.interval, onProgress);
 
-    if (!result.success || !result.accessToken) {
+    if (result.success || !result.accessToken) {
       return result;
     }

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:209:18
     }
 
     // Step 3: Save token via the existing auth service
-    onProgress?.('Saving token...');
+    onProgress?.("");
     const saveResult = await saveToken(result.accessToken);
 

[NoCoverage] BooleanLiteral
src/services/github/device-flow.ts:212:9
     onProgress?.('Saving token...');
     const saveResult = await saveToken(result.accessToken);
 
-    if (!saveResult.success) {
+    if (saveResult.success) {
       return {
         success: false,

[NoCoverage] LogicalOperator
src/services/github/device-flow.ts:216:27
       return {
         success: false,
         error: 'save_error',
-        errorDescription: saveResult.error || 'Failed to save token',
+        errorDescription: saveResult.error && 'Failed to save token',
       };
     }

[NoCoverage] BooleanLiteral
src/services/github/device-flow.ts:220:23
       };
     }
 
-    return { success: true, accessToken: result.accessToken };
+    return { success: false, accessToken: result.accessToken };
   } catch (err) {
     return {

[NoCoverage] StringLiteral
src/services/github/device-flow.ts:224:14
   } catch (err) {
     return {
       success: false,
-      error: 'unexpected_error',
+      error: "",
       errorDescription: err instanceof Error ? err.message : 'An unexpected error occurred',
     };

[NoCoverage] ArrowFunction
src/services/github/device-flow.ts:231:22
 }
 
 function delay(ms: number): Promise<void> {
-  return new Promise((resolve) => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 
