[Killed] StringLiteral
src/services/security/crypto.ts:7:19
  * Uses AES-GCM with a device-persistent master key.
  */
 
-const ALGORITHM = 'AES-GCM';
+const ALGORITHM = "";
 const KEY_STORAGE_NAME = 'gist-hub-master-key';
 
killedBy: crypto encrypt / decrypt should round-trip a simple string
statusReason: Unrecognized algorithm name

[Survived] StringLiteral
src/services/security/crypto.ts:8:26
  */
 
 const ALGORITHM = 'AES-GCM';
-const KEY_STORAGE_NAME = 'gist-hub-master-key';
+const KEY_STORAGE_NAME = "";
 
 /**

[Killed] BlockStatement
src/services/security/crypto.ts:54:15
   const { getMetadata, setMetadata } = await import('../db');
 
   const stored = await getMetadata<JsonWebKey>(KEY_STORAGE_NAME);
-  if (stored) {
-    return window.crypto.subtle.importKey('jwk', stored, { name: ALGORITHM }, false, [
-      'encrypt',
-      'decrypt',
-    ]);
-  }
+  if (stored) {}
 
   const key = await window.crypto.subtle.generateKey({ name: ALGORITHM, length: 256 }, true, [
killedBy: crypto encrypt / decrypt should round-trip a simple string
statusReason: The operation failed for an operation-specific reason

[Survived] BooleanLiteral
src/services/security/crypto.ts:55:79
 
   const stored = await getMetadata<JsonWebKey>(KEY_STORAGE_NAME);
   if (stored) {
-    return window.crypto.subtle.importKey('jwk', stored, { name: ALGORITHM }, false, [
+    return window.crypto.subtle.importKey('jwk', stored, { name: ALGORITHM }, true, [
       'encrypt',
       'decrypt',

[Killed] BooleanLiteral
src/services/security/crypto.ts:61:88
     ]);
   }
 
-  const key = await window.crypto.subtle.generateKey({ name: ALGORITHM, length: 256 }, true, [
+  const key = await window.crypto.subtle.generateKey({ name: ALGORITHM, length: 256 }, false, [
     'encrypt',
     'decrypt',
killedBy: crypto encrypt / decrypt should round-trip a simple string
statusReason: key is not extractable

[Survived] BooleanLiteral
src/services/security/crypto.ts:70:74
   await setMetadata(KEY_STORAGE_NAME, jwk);
 
   // Re-import as non-extractable for runtime use to prevent XSS exfiltration
-  return window.crypto.subtle.importKey('jwk', jwk, { name: ALGORITHM }, false, [
+  return window.crypto.subtle.importKey('jwk', jwk, { name: ALGORITHM }, true, [
     'encrypt',
     'decrypt',

[Killed] ArrayDeclaration
src/services/security/crypto.ts:70:81
   await setMetadata(KEY_STORAGE_NAME, jwk);
 
   // Re-import as non-extractable for runtime use to prevent XSS exfiltration
-  return window.crypto.subtle.importKey('jwk', jwk, { name: ALGORITHM }, false, [
-    'encrypt',
-    'decrypt',
-  ]);
+  return window.crypto.subtle.importKey('jwk', jwk, { name: ALGORITHM }, false, []);
 }
 
killedBy: crypto encrypt / decrypt should round-trip a simple string
statusReason: Usages cannot be empty when importing a secret key.

[Killed] ConditionalExpression
src/services/security/crypto.ts:83:19
 export function b64decode(str: string): Uint8Array {
   const binary = atob(str);
   const bytes = new Uint8Array(binary.length);
-  for (let i = 0; i < binary.length; i++) {
+  for (let i = 0; false; i++) {
     bytes[i] = binary.charCodeAt(i);
   }
killedBy: crypto encrypt / decrypt should round-trip a simple string
statusReason: The operation failed for an operation-specific reason

[Killed] BlockStatement
src/services/security/crypto.ts:83:43
 export function b64decode(str: string): Uint8Array {
   const binary = atob(str);
   const bytes = new Uint8Array(binary.length);
-  for (let i = 0; i < binary.length; i++) {
-    bytes[i] = binary.charCodeAt(i);
-  }
+  for (let i = 0; i < binary.length; i++) {}
   return bytes;
 }
killedBy: crypto encrypt / decrypt should round-trip a simple string
statusReason: The operation failed for an operation-specific reason
