[Killed] LogicalOperator
src/components/gist-detail.ts:285:24
           const contentArea = container.querySelector('#file-content-area code');
           if (!contentArea) return;
 
-          const text = contentArea.textContent || '';
+          const text = contentArea.textContent && '';
           try {
             if (!navigator.clipboard) {
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Received:

  1st vi.fn() call:

  [
-   "content",

[Killed] BlockStatement
src/components/gist-detail.ts:286:15
           if (!contentArea) return;
 
           const text = contentArea.textContent || '';
-          try {
-            if (!navigator.clipboard) {
-              throw new Error('Clipboard API not available');
-            }
-            await navigator.clipboard.writeText(text);
-            if (signal?.aborted) return;
-
-            const originalText = copyBtn.innerHTML;
-            copyBtn.innerHTML = '<span class="micro-label">✅ COPIED!</span>';
-            copyBtn.classList.add('btn-success');
-            toast.success('COPIED TO CLIPBOARD');
-
-            setTimeout(() => {
-              if (signal?.aborted) return;
-              copyBtn.innerHTML = originalText;
-              copyBtn.classList.remove('btn-success');
-            }, 2000);
-          } catch (err) {
+          try {} catch (err) {
             safeError('Failed to copy', err);
             toast.error('COPY FAILED');
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/gist-detail.ts:287:17
 
           const text = contentArea.textContent || '';
           try {
-            if (!navigator.clipboard) {
+            if (true) {
               throw new Error('Clipboard API not available');
             }
killedBy: GistDetail bindDetailEvents copies content to clipboard when copy button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'content' ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/gist-detail.ts:287:17
 
           const text = contentArea.textContent || '';
           try {
-            if (!navigator.clipboard) {
+            if (false) {
               throw new Error('Clipboard API not available');
             }

[Killed] ConditionalExpression
src/components/gist-detail.ts:291:17
               throw new Error('Clipboard API not available');
             }
             await navigator.clipboard.writeText(text);
-            if (signal?.aborted) return;
+            if (true) return;
 
             const originalText = copyBtn.innerHTML;
killedBy: GistDetail bindDetailEvents shows copy success feedback and resets after timeout
statusReason: expected '\n              <span class="micro-la…' to contain 'COPIED!'

[Survived] ConditionalExpression
src/components/gist-detail.ts:291:17
               throw new Error('Clipboard API not available');
             }
             await navigator.clipboard.writeText(text);
-            if (signal?.aborted) return;
+            if (false) return;
 
             const originalText = copyBtn.innerHTML;

[Survived] StringLiteral
src/components/gist-detail.ts:296:27
             const originalText = copyBtn.innerHTML;
             copyBtn.innerHTML = '<span class="micro-label">✅ COPIED!</span>';
             copyBtn.classList.add('btn-success');
-            toast.success('COPIED TO CLIPBOARD');
+            toast.success("");
 
             setTimeout(() => {

[Killed] BlockStatement
src/components/gist-detail.ts:298:30
             copyBtn.classList.add('btn-success');
             toast.success('COPIED TO CLIPBOARD');
 
-            setTimeout(() => {
-              if (signal?.aborted) return;
-              copyBtn.innerHTML = originalText;
-              copyBtn.classList.remove('btn-success');
-            }, 2000);
+            setTimeout(() => {}, 2000);
           } catch (err) {
             safeError('Failed to copy', err);
killedBy: GistDetail bindDetailEvents shows copy success feedback and resets after timeout
statusReason: expected '<span class="micro-label">✅ COPIED!</…' to contain 'COPY'

[Killed] ConditionalExpression
src/components/gist-detail.ts:299:19
             toast.success('COPIED TO CLIPBOARD');
 
             setTimeout(() => {
-              if (signal?.aborted) return;
+              if (true) return;
               copyBtn.innerHTML = originalText;
               copyBtn.classList.remove('btn-success');
killedBy: GistDetail bindDetailEvents shows copy success feedback and resets after timeout
statusReason: expected '<span class="micro-label">✅ COPIED!</…' to contain 'COPY'

[Survived] ConditionalExpression
src/components/gist-detail.ts:299:19
             toast.success('COPIED TO CLIPBOARD');
 
             setTimeout(() => {
-              if (signal?.aborted) return;
+              if (false) return;
               copyBtn.innerHTML = originalText;
               copyBtn.classList.remove('btn-success');

[NoCoverage] BlockStatement
src/components/gist-detail.ts:303:25
               copyBtn.innerHTML = originalText;
               copyBtn.classList.remove('btn-success');
             }, 2000);
-          } catch (err) {
-            safeError('Failed to copy', err);
-            toast.error('COPY FAILED');
-          }
+          } catch (err) {}
         })();
       },

[NoCoverage] StringLiteral
src/components/gist-detail.ts:305:25
             }, 2000);
           } catch (err) {
             safeError('Failed to copy', err);
-            toast.error('COPY FAILED');
+            toast.error("");
           }
         })();

[Survived] StringLiteral
src/components/gist-detail.ts:311:35
       },
       { signal }
     );
-    container.dataset.copyBound = 'true';
+    container.dataset.copyBound = "";
 
     // Reset copyBound when the signal aborts so revisiting the route will re-bind

[NoCoverage] BlockStatement
src/components/gist-detail.ts:316:13
     // Reset copyBound when the signal aborts so revisiting the route will re-bind
     signal?.addEventListener(
       'abort',
-      () => {
-        delete container.dataset.copyBound;
-      },
+      () => {},
       { once: true }
     );

[NoCoverage] ObjectLiteral
src/components/gist-detail.ts:319:7
       () => {
         delete container.dataset.copyBound;
       },
-      { once: true }
+      {}
     );
   }

[Survived] BlockStatement
src/components/gist-detail.ts:331:9
     onViewRevision,
   }: { onBack: () => void; onViewRevision: (id: string, version: string) => void },
   signal?: AbortSignal
-): void {
-  const gistId = container.querySelector('.revisions-list')?.getAttribute('data-gist-id');
-  container.querySelector('#gist-back-btn')?.addEventListener('click', () => onBack(), { signal });
-  container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {
-    btn.addEventListener(
-      'click',
-      (e) => {
-        const version = (e.currentTarget as HTMLElement).getAttribute('data-version');
-        if (gistId && version) onViewRevision(gistId, version);
-      },
-      { signal }
-    );
-  });
-}
+): void {}
 

[Survived] ArrowFunction
src/components/gist-detail.ts:333:72
   signal?: AbortSignal
 ): void {
   const gistId = container.querySelector('.revisions-list')?.getAttribute('data-gist-id');
-  container.querySelector('#gist-back-btn')?.addEventListener('click', () => onBack(), { signal });
+  container.querySelector('#gist-back-btn')?.addEventListener('click', () => undefined, { signal });
   container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {
     btn.addEventListener(

[Survived] StringLiteral
src/components/gist-detail.ts:333:63
   signal?: AbortSignal
 ): void {
   const gistId = container.querySelector('.revisions-list')?.getAttribute('data-gist-id');
-  container.querySelector('#gist-back-btn')?.addEventListener('click', () => onBack(), { signal });
+  container.querySelector('#gist-back-btn')?.addEventListener("", () => onBack(), { signal });
   container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {
     btn.addEventListener(

[Survived] BlockStatement
src/components/gist-detail.ts:334:80
 ): void {
   const gistId = container.querySelector('.revisions-list')?.getAttribute('data-gist-id');
   container.querySelector('#gist-back-btn')?.addEventListener('click', () => onBack(), { signal });
-  container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {
-    btn.addEventListener(
-      'click',
-      (e) => {
-        const version = (e.currentTarget as HTMLElement).getAttribute('data-version');
-        if (gistId && version) onViewRevision(gistId, version);
-      },
-      { signal }
-    );
-  });
+  container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {});
 }
 

[Survived] StringLiteral
src/components/gist-detail.ts:336:7
   container.querySelector('#gist-back-btn')?.addEventListener('click', () => onBack(), { signal });
   container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {
     btn.addEventListener(
-      'click',
+      "",
       (e) => {
         const version = (e.currentTarget as HTMLElement).getAttribute('data-version');

[NoCoverage] BlockStatement
src/components/gist-detail.ts:337:14
   container.querySelectorAll('[data-action="view-revision"]').forEach((btn) => {
     btn.addEventListener(
       'click',
-      (e) => {
-        const version = (e.currentTarget as HTMLElement).getAttribute('data-version');
-        if (gistId && version) onViewRevision(gistId, version);
-      },
+      (e) => {},
       { signal }
     );
