[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:35:7
   const conflictingFields: string[] = [];
 
   // Compare timestamps - if remote is newer than local's last sync, potential conflict
-  if (remote.updated_at > local.updatedAt) {
+  if (false) {
     // Check if content actually differs
     if (hasContentChanged(local, remote)) {
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] EqualityOperator
src/services/sync/conflict-detector.ts:35:7
   const conflictingFields: string[] = [];
 
   // Compare timestamps - if remote is newer than local's last sync, potential conflict
-  if (remote.updated_at > local.updatedAt) {
+  if (remote.updated_at <= local.updatedAt) {
     // Check if content actually differs
     if (hasContentChanged(local, remote)) {
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:37:9
   // Compare timestamps - if remote is newer than local's last sync, potential conflict
   if (remote.updated_at > local.updatedAt) {
     // Check if content actually differs
-    if (hasContentChanged(local, remote)) {
+    if (false) {
       conflictingFields.push('content');
     }
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:37:9
   // Compare timestamps - if remote is newer than local's last sync, potential conflict
   if (remote.updated_at > local.updatedAt) {
     // Check if content actually differs
-    if (hasContentChanged(local, remote)) {
+    if (true) {
       conflictingFields.push('content');
     }
killedBy: ConflictDetector detectConflict does NOT detect conflict when remote is newer but content identical
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] StringLiteral
src/services/sync/conflict-detector.ts:38:30
   if (remote.updated_at > local.updatedAt) {
     // Check if content actually differs
     if (hasContentChanged(local, remote)) {
-      conflictingFields.push('content');
+      conflictingFields.push("");
     }
   }
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected [ '' ] to deeply equal [ 'content' ]

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:43:7
   }
 
   // Compare description
-  if (local.description !== remote.description) {
+  if (false) {
     conflictingFields.push('description');
   }
killedBy: ConflictDetector detectConflict detects conflict when description changes
statusReason: expected null not to be null

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:43:49
   }
 
   // Compare description
-  if (local.description !== remote.description) {
-    conflictingFields.push('description');
-  }
+  if (local.description !== remote.description) {}
 
   // Compare public flag
killedBy: ConflictDetector detectConflict detects conflict when description changes
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:48:7
   }
 
   // Compare public flag
-  if (local.public !== remote.public) {
+  if (true) {
     conflictingFields.push('public');
   }
killedBy: ConflictDetector detectConflict returns null for identical gists
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:48:7
   }
 
   // Compare public flag
-  if (local.public !== remote.public) {
+  if (false) {
     conflictingFields.push('public');
   }
killedBy: ConflictDetector detectConflict detects conflict when public status changes
statusReason: expected null not to be null

[Killed] StringLiteral
src/services/sync/conflict-detector.ts:49:28
 
   // Compare public flag
   if (local.public !== remote.public) {
-    conflictingFields.push('public');
+    conflictingFields.push("");
   }
 
killedBy: ConflictDetector detectConflict detects conflict when public status changes
statusReason: expected [ '' ] to deeply equal [ 'public' ]

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:55:39
   // Compare starred status (from remote checkIfStarred)
   // Note: starred is local-only, GitHub doesn't expose it in the gist API directly
 
-  if (conflictingFields.length === 0) {
-    return null;
-  }
+  if (conflictingFields.length === 0) {}
 
   return {
killedBy: ConflictDetector detectConflict returns null for identical gists
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] EqualityOperator
src/services/sync/conflict-detector.ts:55:7
   // Compare starred status (from remote checkIfStarred)
   // Note: starred is local-only, GitHub doesn't expose it in the gist API directly
 
-  if (conflictingFields.length === 0) {
+  if (conflictingFields.length !== 0) {
     return null;
   }
killedBy: ConflictDetector detectConflict returns null for identical gists
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] EqualityOperator
src/services/sync/conflict-detector.ts:76:7
   const remoteFiles = Object.keys(remote.files);
 
   // File count changed
-  if (localFiles.length !== remoteFiles.length) {
+  if (localFiles.length === remoteFiles.length) {
     return true;
   }
killedBy: ConflictDetector detectConflict does NOT detect conflict when remote is newer but content identical
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:76:7
   const remoteFiles = Object.keys(remote.files);
 
   // File count changed
-  if (localFiles.length !== remoteFiles.length) {
+  if (true) {
     return true;
   }
killedBy: ConflictDetector detectConflict does NOT detect conflict when remote is newer but content identical
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] BooleanLiteral
src/services/sync/conflict-detector.ts:77:12
 
   // File count changed
   if (localFiles.length !== remoteFiles.length) {
-    return true;
+    return false;
   }
 
killedBy: ConflictDetector detectConflict detects content conflict when file count differs
statusReason: expected null not to be null

[Killed] ArrowFunction
src/services/sync/conflict-detector.ts:81:25
   }
 
   // File names changed
-  if (!localFiles.every((f) => remoteFiles.includes(f))) {
+  if (!localFiles.every(() => undefined)) {
     return true;
   }
killedBy: ConflictDetector detectConflict does NOT detect conflict when remote is newer but content identical
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:81:7
   }
 
   // File names changed
-  if (!localFiles.every((f) => remoteFiles.includes(f))) {
+  if (true) {
     return true;
   }
killedBy: ConflictDetector detectConflict does NOT detect conflict when remote is newer but content identical
statusReason: expected { gistId: 'gist123', …(4) } to be null

[Killed] BooleanLiteral
src/services/sync/conflict-detector.ts:82:12
 
   // File names changed
   if (!localFiles.every((f) => remoteFiles.includes(f))) {
-    return true;
+    return false;
   }
 
killedBy: ConflictDetector detectConflict detects content conflict when file names differ
statusReason: expected null not to be null

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:86:38
   }
 
   // File content changed (check sizes as proxy)
-  for (const filename of localFiles) {
-    const localFile = local.files[filename];
-    const remoteFile = remote.files[filename];
-
-    if (localFile?.size !== remoteFile?.size) {
-      return true;
-    }
-  }
+  for (const filename of localFiles) {}
 
   return false;
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] EqualityOperator
src/services/sync/conflict-detector.ts:90:9
     const localFile = local.files[filename];
     const remoteFile = remote.files[filename];
 
-    if (localFile?.size !== remoteFile?.size) {
+    if (localFile?.size === remoteFile?.size) {
       return true;
     }
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:90:9
     const localFile = local.files[filename];
     const remoteFile = remote.files[filename];
 
-    if (localFile?.size !== remoteFile?.size) {
+    if (false) {
       return true;
     }
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/services/sync/conflict-detector.ts:91:14
     const remoteFile = remote.files[filename];
 
     if (localFile?.size !== remoteFile?.size) {
-      return true;
+      return false;
     }
   }
killedBy: ConflictDetector detectConflict detects content conflict when remote is newer and size differs
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:104:5
  */
 export function resolveConflict(conflict: GistConflict, strategy: ResolutionStrategy): GistRecord {
   switch (strategy) {
-    case 'local-wins':
-      // Keep local version, update sync status
-      return {
-        ...conflict.localVersion,
-        syncStatus: 'pending', // Will sync to remote
-      };
+    case 'local-wins':
 
     case 'remote-wins':
killedBy: ConflictDetector resolveConflict local-wins keeps local description and sets pending
statusReason: expected 'Remote' to be 'Local' // Object.is equality

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:111:5
         syncStatus: 'pending', // Will sync to remote
       };
 
-    case 'remote-wins':
-      // Accept remote version
-      return githubGistToResolvedRecord(conflict.remoteVersion, conflict.localVersion.starred);
+    case 'remote-wins':
 
     case 'manual':
killedBy: ConflictDetector resolveConflict remote-wins takes remote description and preserves starred
statusReason: expected 'Local' to be 'Remote' // Object.is equality

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:115:5
       // Accept remote version
       return githubGistToResolvedRecord(conflict.remoteVersion, conflict.localVersion.starred);
 
-    case 'manual':
-      // Mark as conflict for manual resolution
-      return {
-        ...conflict.localVersion,
-        syncStatus: 'conflict',
-      };
+    case 'manual':
 
     default:
killedBy: ConflictDetector resolveConflict manual sets conflict status
statusReason: Unknown resolution strategy: manual

[Survived] ArrayDeclaration
src/services/sync/conflict-detector.ts:135:57
     id: remote.id,
     description: remote.description,
     files: Object.fromEntries(
-      Object.entries(remote.files).map(([key, file]) => [
-        key,
-        {
-          filename: file.filename,
-          type: file.type,
-          language: file.language,
-          rawUrl: file.raw_url,
-          size: file.size,
-          truncated: file.truncated,
-        },
-      ])
+      Object.entries(remote.files).map(([key, file]) => [])
     ),
     htmlUrl: remote.html_url,

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:170:76
 /**
  * Store conflict in IndexedDB for later retrieval.
  */
-export async function storeConflict(conflict: GistConflict): Promise<void> {
-  await storeConflicts([conflict]);
-}
+export async function storeConflict(conflict: GistConflict): Promise<void> {}
 
 /**
killedBy: ConflictDetector storeConflict / storeConflicts stores a single conflict via storeConflict
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts' ]

Number of calls: 0

[Killed] ArrayDeclaration
src/services/sync/conflict-detector.ts:171:24
  * Store conflict in IndexedDB for later retrieval.
  */
 export async function storeConflict(conflict: GistConflict): Promise<void> {
-  await storeConflicts([conflict]);
+  await storeConflicts([]);
 }
 
killedBy: ConflictDetector storeConflict / storeConflicts stores a single conflict via storeConflict
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts' ]

Number of calls: 0

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:178:83
  * Store multiple conflicts in IndexedDB in a single operation.
  * Prevents race conditions during parallel processing.
  */
-export async function storeConflicts(newConflicts: GistConflict[]): Promise<void> {
-  if (newConflicts.length === 0) return;
-
-  const db = getDB();
-  const tx = db.transaction('metadata', 'readwrite');
-  const store = tx.objectStore('metadata');
-
-  // Use a transaction-safe read-modify-write pattern
-  const record = await store.get('sync-conflicts');
-  const conflicts = (record?.value as GistConflict[]) || [];
-  const conflictMap = new Map(conflicts.map((c) => [c.gistId, c]));
-
-  for (const conflict of newConflicts) {
-    conflictMap.set(conflict.gistId, conflict);
-  }
-
-  await store.put({
-    key: 'sync-conflicts',
-    value: Array.from(conflictMap.values()),
-    updatedAt: Date.now(),
-  });
-
-  await tx.done;
-}
+export async function storeConflicts(newConflicts: GistConflict[]): Promise<void> {}
 
 /**
killedBy: ConflictDetector storeConflict / storeConflicts stores a single conflict via storeConflict
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:179:7
  * Prevents race conditions during parallel processing.
  */
 export async function storeConflicts(newConflicts: GistConflict[]): Promise<void> {
-  if (newConflicts.length === 0) return;
+  if (true) return;
 
   const db = getDB();
killedBy: ConflictDetector storeConflict / storeConflicts stores a single conflict via storeConflict
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:179:7
  * Prevents race conditions during parallel processing.
  */
 export async function storeConflicts(newConflicts: GistConflict[]): Promise<void> {
-  if (newConflicts.length === 0) return;
+  if (false) return;
 
   const db = getDB();
killedBy: ConflictDetector storeConflict / storeConflicts does nothing when storeConflicts receives empty array
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "metadata",

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:190:40
   const conflicts = (record?.value as GistConflict[]) || [];
   const conflictMap = new Map(conflicts.map((c) => [c.gistId, c]));
 
-  for (const conflict of newConflicts) {
-    conflictMap.set(conflict.gistId, conflict);
-  }
+  for (const conflict of newConflicts) {}
 
   await store.put({
killedBy: ConflictDetector storeConflict / storeConflicts stores a single conflict via storeConflict
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
src/services/sync/conflict-detector.ts:195:10
   }
 
   await store.put({
-    key: 'sync-conflicts',
+    key: "",
     value: Array.from(conflictMap.values()),
     updatedAt: Date.now(),
killedBy: ConflictDetector storeConflict / storeConflicts stores a single conflict via storeConflict
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,9 @@
  [

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:214:68
 /**
  * Clear a resolved conflict.
  */
-export async function clearConflict(gistId: string): Promise<void> {
-  const { getMetadata, setMetadata } = await import('../db');
-  const conflicts = (await getMetadata<GistConflict[]>('sync-conflicts')) || [];
-  const filtered = conflicts.filter((c) => c.gistId !== gistId);
-  await setMetadata('sync-conflicts', filtered);
-}
+export async function clearConflict(gistId: string): Promise<void> {}
 
 /**
killedBy: ConflictDetector clearConflict removes a specific conflict by gistId
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts', …(1) ]

Number of calls: 0

[Killed] MethodExpression
src/services/sync/conflict-detector.ts:217:20
 export async function clearConflict(gistId: string): Promise<void> {
   const { getMetadata, setMetadata } = await import('../db');
   const conflicts = (await getMetadata<GistConflict[]>('sync-conflicts')) || [];
-  const filtered = conflicts.filter((c) => c.gistId !== gistId);
+  const filtered = conflicts;
   await setMetadata('sync-conflicts', filtered);
 }
killedBy: ConflictDetector clearConflict removes a specific conflict by gistId
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,16 @@
  [

[Killed] ConditionalExpression
src/services/sync/conflict-detector.ts:217:44
 export async function clearConflict(gistId: string): Promise<void> {
   const { getMetadata, setMetadata } = await import('../db');
   const conflicts = (await getMetadata<GistConflict[]>('sync-conflicts')) || [];
-  const filtered = conflicts.filter((c) => c.gistId !== gistId);
+  const filtered = conflicts.filter((c) => false);
   await setMetadata('sync-conflicts', filtered);
 }
killedBy: ConflictDetector clearConflict removes a specific conflict by gistId
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts', …(1) ]

Received:

  1st vi.fn() call:

  [
    "sync-conflicts",

[Killed] StringLiteral
src/services/sync/conflict-detector.ts:218:21
   const { getMetadata, setMetadata } = await import('../db');
   const conflicts = (await getMetadata<GistConflict[]>('sync-conflicts')) || [];
   const filtered = conflicts.filter((c) => c.gistId !== gistId);
-  await setMetadata('sync-conflicts', filtered);
+  await setMetadata("", filtered);
 }
 
killedBy: ConflictDetector clearConflict removes a specific conflict by gistId
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
src/services/sync/conflict-detector.ts:224:58
 /**
  * Clear all conflicts (e.g., on logout).
  */
-export async function clearAllConflicts(): Promise<void> {
-  const { setMetadata } = await import('../db');
-  await setMetadata('sync-conflicts', []);
-}
+export async function clearAllConflicts(): Promise<void> {}
 
killedBy: ConflictDetector clearAllConflicts clears all stored conflicts
statusReason: expected "vi.fn()" to be called with arguments: [ 'sync-conflicts', [] ]

Number of calls: 0
