[Killed] ObjectLiteral
src/services/security/dom.ts:6:47
  * Prevents XSS and ensures secure DOM manipulation.
  */
 
-const ESCAPE_LOOKUP: Record<string, string> = {
-  '&': '&amp;',
-  '<': '&lt;',
-  '>': '&gt;',
-  '"': '&quot;',
-  "'": '&#039;',
-};
+const ESCAPE_LOOKUP: Record<string, string> = {};
 
 /**
killedBy: GistDetail renderFileContent sanitizes content
statusReason: expected '<pre class="code-block language-html"…' to contain '&lt;script&gt;'

[Killed] StringLiteral
src/services/security/dom.ts:7:8
  */
 
 const ESCAPE_LOOKUP: Record<string, string> = {
-  '&': '&amp;',
+  '&': "",
   '<': '&lt;',
   '>': '&gt;',
killedBy: sanitizeHtml escapes special characters
statusReason: expected '&lt;script&gt;alert(&quot;xss&quot;)&…' to be '&lt;script&gt;alert(&quot;xss&quot;)&…' // Object.is equality

[Killed] LogicalOperator
src/services/security/dom.ts:19:7
  * ⚡ Bolt: Fast single-pass regex-based escaping for maximum performance
  */
 export function sanitizeHtml(input: string): string {
-  if (input === null || input === undefined) return '';
+  if (input === null && input === undefined) return '';
   return String(input).replace(/[&<>"']/g, (match) => ESCAPE_LOOKUP[match]!);
 }
killedBy: sanitizeHtml handles null/undefined
statusReason: expected 'null' to be '' // Object.is equality

[Killed] ConditionalExpression
src/services/security/dom.ts:19:7
  * ⚡ Bolt: Fast single-pass regex-based escaping for maximum performance
  */
 export function sanitizeHtml(input: string): string {
-  if (input === null || input === undefined) return '';
+  if (true) return '';
   return String(input).replace(/[&<>"']/g, (match) => ESCAPE_LOOKUP[match]!);
 }
killedBy: sanitizeHtml escapes special characters
statusReason: expected '' to be '&lt;script&gt;alert(&quot;xss&quot;)&…' // Object.is equality

[Killed] StringLiteral
src/services/security/dom.ts:32:24
     let sanitizedValue = '';
 
     if (value === undefined || value === null) {
-      sanitizedValue = '';
+      sanitizedValue = "Stryker was here!";
     } else if (Array.isArray(value)) {
       // ✅ Sentinel: Recursively sanitize array elements
killedBy: html tagged template returns plain string when no interpolations
statusReason: expected '<div>hello</div>Stryker was here!' to be '<div>hello</div>' // Object.is equality

[Killed] BlockStatement
src/services/security/dom.ts:33:38
 
     if (value === undefined || value === null) {
       sanitizedValue = '';
-    } else if (Array.isArray(value)) {
-      // ✅ Sentinel: Recursively sanitize array elements
-      sanitizedValue = value.map((v) => sanitizeHtml(String(v))).join('');
-    } else {
+    } else if (Array.isArray(value)) {} else {
       sanitizedValue = sanitizeHtml(String(value));
     }
killedBy: html tagged template sanitizes each element in an array
statusReason: expected '<ul></ul>' to be '<ul>&lt;b&gt;bold&lt;/b&gt;&lt;script…' // Object.is equality

[Killed] ArrowFunction
src/services/security/dom.ts:35:34
       sanitizedValue = '';
     } else if (Array.isArray(value)) {
       // ✅ Sentinel: Recursively sanitize array elements
-      sanitizedValue = value.map((v) => sanitizeHtml(String(v))).join('');
+      sanitizedValue = value.map(() => undefined).join('');
     } else {
       sanitizedValue = sanitizeHtml(String(value));
killedBy: html tagged template sanitizes each element in an array
statusReason: expected '<ul></ul>' to be '<ul>&lt;b&gt;bold&lt;/b&gt;&lt;script…' // Object.is equality

[Killed] BlockStatement
src/services/security/dom.ts:36:12
     } else if (Array.isArray(value)) {
       // ✅ Sentinel: Recursively sanitize array elements
       sanitizedValue = value.map((v) => sanitizeHtml(String(v))).join('');
-    } else {
-      sanitizedValue = sanitizeHtml(String(value));
-    }
+    } else {}
 
     return acc + str + sanitizedValue;
killedBy: html tagged template sanitizes interpolated string values
statusReason: expected '<div></div>' to be '<div>&lt;script&gt;alert(&quot;xss&qu…' // Object.is equality
