[Killed] ConditionalExpression
src/services/security/logger.ts:22:7
  * Looks for patterns like ghp_.*, gho_.*, github_pat_.*, etc.
  */
 export function redactSecrets(input: string): string {
-  if (!input) return input;
+  if (true) return input;
 
   // GitHub token patterns
killedBy: security logger redactSecrets should redact various PAT patterns
statusReason: expected 'My token is ghp_1234567890abcdefghijk…' to be 'My token is [REDACTED] and fine-grain…' // Object.is equality

[Killed] BooleanLiteral
src/services/security/logger.ts:22:7
  * Looks for patterns like ghp_.*, gho_.*, github_pat_.*, etc.
  */
 export function redactSecrets(input: string): string {
-  if (!input) return input;
+  if (input) return input;
 
   // GitHub token patterns
killedBy: security logger redactSecrets should redact various PAT patterns
statusReason: expected 'My token is ghp_1234567890abcdefghijk…' to be 'My token is [REDACTED] and fine-grain…' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:26:5
 
   // GitHub token patterns
   const patterns = [
-    /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
+    /(ghp_[A-Za-z0-9_])/g, // Personal Access Token (classic)
     /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
     /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
killedBy: security logger redactSecrets should redact various PAT patterns
statusReason: expected 'My token is [REDACTED]234567890abcdef…' to be 'My token is [REDACTED] and fine-grain…' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:26:5
 
   // GitHub token patterns
   const patterns = [
-    /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
+    /(ghp_[^A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
     /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
     /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
killedBy: security logger redactSecrets should redact various PAT patterns
statusReason: expected 'My token is ghp_1234567890abcdefghijk…' to be 'My token is [REDACTED] and fine-grain…' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:27:5
   // GitHub token patterns
   const patterns = [
     /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
-    /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
+    /(github_pat_[^A-Za-z0-9_]{22,})/g, // Fine-grained PAT
     /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
     /(Bearer [A-Za-z0-9._-]{20,})/g, // Bearer token
killedBy: security logger redactSecrets should redact various PAT patterns
statusReason: expected 'My token is [REDACTED] and fine-grain…' to be 'My token is [REDACTED] and fine-grain…' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:28:5
   const patterns = [
     /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
     /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
-    /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
+    /(gho_[A-Za-z0-9_])/g, // OAuth token
     /(Bearer [A-Za-z0-9._-]{20,})/g, // Bearer token
     /(token [A-Za-z0-9_]{20,})/g, // Token header value
killedBy: security logger redactSecrets redacts gho_ OAuth token pattern
statusReason: expected 'Token: [REDACTED]234567890abcdefghijk…' to be 'Token: [REDACTED]' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:28:5
   const patterns = [
     /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
     /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
-    /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
+    /(gho_[^A-Za-z0-9_]{36,})/g, // OAuth token
     /(Bearer [A-Za-z0-9._-]{20,})/g, // Bearer token
     /(token [A-Za-z0-9_]{20,})/g, // Token header value
killedBy: security logger redactSecrets redacts gho_ OAuth token pattern
statusReason: expected 'Token: gho_1234567890abcdefghijklmnop…' to be 'Token: [REDACTED]' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:29:5
     /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
     /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
     /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
-    /(Bearer [A-Za-z0-9._-]{20,})/g, // Bearer token
+    /(Bearer [^A-Za-z0-9._-]{20,})/g, // Bearer token
     /(token [A-Za-z0-9_]{20,})/g, // Token header value
   ];
killedBy: security logger redactSecrets redacts Bearer token pattern in strings
statusReason: expected 'Authorization: Bearer eyJhbGciOiJIUzI…' to be 'Authorization: [REDACTED]' // Object.is equality

[Killed] Regex
src/services/security/logger.ts:29:5
     /(ghp_[A-Za-z0-9_]{36,})/g, // Personal Access Token (classic)
     /(github_pat_[A-Za-z0-9_]{22,})/g, // Fine-grained PAT
     /(gho_[A-Za-z0-9_]{36,})/g, // OAuth token
-    /(Bearer [A-Za-z0-9._-]{20,})/g, // Bearer token
+    /(Bearer [A-Za-z0-9._-])/g, // Bearer token
     /(token [A-Za-z0-9_]{20,})/g, // Token header value
   ];
killedBy: security logger redactSecrets redacts Bearer token pattern in strings
statusReason: expected 'Authorization: [REDACTED]yJhbGciOiJIU…' to be 'Authorization: [REDACTED]' // Object.is equality

[Killed] BlockStatement
src/services/security/logger.ts:34:35
   ];
 
   let result = input;
-  for (const pattern of patterns) {
-    result = result.replace(pattern, '[REDACTED]');
-  }
+  for (const pattern of patterns) {}
 
   return result;
killedBy: security logger redactSecrets should redact various PAT patterns
statusReason: expected 'My token is ghp_1234567890abcdefghijk…' to be 'My token is [REDACTED] and fine-grain…' // Object.is equality

[Killed] EqualityOperator
src/services/security/logger.ts:48:7
  */
 export function redactAny(arg: unknown, depth = 0, seen = new WeakSet()): unknown {
   // Bounded recursion
-  if (depth > 10) return '[DEPTH_EXCEEDED]';
+  if (depth <= 10) return '[DEPTH_EXCEEDED]';
 
   if (typeof arg === 'string') {
killedBy: security logger redactSecrets should handle strings
statusReason: expected '[DEPTH_EXCEEDED]' to be '[REDACTED]' // Object.is equality

[Killed] EqualityOperator
src/services/security/logger.ts:48:7
  */
 export function redactAny(arg: unknown, depth = 0, seen = new WeakSet()): unknown {
   // Bounded recursion
-  if (depth > 10) return '[DEPTH_EXCEEDED]';
+  if (depth >= 10) return '[DEPTH_EXCEEDED]';
 
   if (typeof arg === 'string') {
killedBy: security logger redactSecrets handles depth limit exceeded
statusReason: expected '[DEPTH_EXCEEDED]' to deeply equal { val: '[DEPTH_EXCEEDED]' }

[Killed] BlockStatement
src/services/security/logger.ts:50:32
   // Bounded recursion
   if (depth > 10) return '[DEPTH_EXCEEDED]';
 
-  if (typeof arg === 'string') {
-    return redactSecrets(arg);
-  }
+  if (typeof arg === 'string') {}
 
   if (arg instanceof Error) {
killedBy: security logger redactSecrets should handle strings
statusReason: expected 'ghp_1234567890abcdefghijklmnopqrstuvw…' to be '[REDACTED]' // Object.is equality

[Killed] BlockStatement
src/services/security/logger.ts:54:29
     return redactSecrets(arg);
   }
 
-  if (arg instanceof Error) {
-    if (seen.has(arg)) return '[CIRCULAR]';
-    seen.add(arg);
-
-    // Preserve error prototype and custom properties while redacting messages
-    const redactedMessage = redactSecrets(arg.message);
-    const redactedStack = arg.stack ? redactSecrets(arg.stack) : undefined;
-
-    // Create a proxy-like object or a shallow copy that redacts key properties
-    const redactedError = Object.create(Object.getPrototypeOf(arg));
-    Object.getOwnPropertyNames(arg).forEach((prop) => {
-      const val = (arg as unknown as Record<string, unknown>)[prop];
-      if (prop === 'message') {
-        redactedError.message = redactedMessage;
-      } else if (prop === 'stack') {
-        redactedError.stack = redactedStack;
-      } else {
-        redactedError[prop] = redactAny(val, depth + 1, seen);
-      }
-    });
-    return redactedError;
-  }
+  if (arg instanceof Error) {}
 
   if (arg !== null && typeof arg === 'object') {
killedBy: security logger redactSecrets should handle Errors
statusReason: expected undefined to be 'Failed with [REDACTED]' // Object.is equality

[Killed] ConditionalExpression
src/services/security/logger.ts:55:9
   }
 
   if (arg instanceof Error) {
-    if (seen.has(arg)) return '[CIRCULAR]';
+    if (false) return '[CIRCULAR]';
     seen.add(arg);
 
killedBy: security logger redactSecrets handles Error with circular reference
statusReason: expected Error{ …(2) } to be '[CIRCULAR]' // Object.is equality

[Killed] BlockStatement
src/services/security/logger.ts:64:55
 
     // Create a proxy-like object or a shallow copy that redacts key properties
     const redactedError = Object.create(Object.getPrototypeOf(arg));
-    Object.getOwnPropertyNames(arg).forEach((prop) => {
-      const val = (arg as unknown as Record<string, unknown>)[prop];
-      if (prop === 'message') {
-        redactedError.message = redactedMessage;
-      } else if (prop === 'stack') {
-        redactedError.stack = redactedStack;
-      } else {
-        redactedError[prop] = redactAny(val, depth + 1, seen);
-      }
-    });
+    Object.getOwnPropertyNames(arg).forEach((prop) => {});
     return redactedError;
   }
killedBy: security logger redactSecrets should handle Errors
statusReason: expected '' to be 'Failed with [REDACTED]' // Object.is equality

[Killed] ConditionalExpression
src/services/security/logger.ts:66:11
     const redactedError = Object.create(Object.getPrototypeOf(arg));
     Object.getOwnPropertyNames(arg).forEach((prop) => {
       const val = (arg as unknown as Record<string, unknown>)[prop];
-      if (prop === 'message') {
+      if (true) {
         redactedError.message = redactedMessage;
       } else if (prop === 'stack') {
killedBy: security logger redactSecrets should handle Errors
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/security/logger.ts:66:31
     const redactedError = Object.create(Object.getPrototypeOf(arg));
     Object.getOwnPropertyNames(arg).forEach((prop) => {
       const val = (arg as unknown as Record<string, unknown>)[prop];
-      if (prop === 'message') {
-        redactedError.message = redactedMessage;
-      } else if (prop === 'stack') {
+      if (prop === 'message') {} else if (prop === 'stack') {
         redactedError.stack = redactedStack;
       } else {
killedBy: security logger redactSecrets should handle Errors
statusReason: expected '' to be 'Failed with [REDACTED]' // Object.is equality

[Killed] BlockStatement
src/services/security/logger.ts:68:36
       const val = (arg as unknown as Record<string, unknown>)[prop];
       if (prop === 'message') {
         redactedError.message = redactedMessage;
-      } else if (prop === 'stack') {
-        redactedError.stack = redactedStack;
-      } else {
+      } else if (prop === 'stack') {} else {
         redactedError[prop] = redactAny(val, depth + 1, seen);
       }
killedBy: security logger redactSecrets should handle Errors
statusReason: expected undefined to be true // Object.is equality

[Survived] ConditionalExpression
src/services/security/logger.ts:68:18
       const val = (arg as unknown as Record<string, unknown>)[prop];
       if (prop === 'message') {
         redactedError.message = redactedMessage;
-      } else if (prop === 'stack') {
+      } else if (false) {
         redactedError.stack = redactedStack;
       } else {

[NoCoverage] BlockStatement
src/services/security/logger.ts:70:14
         redactedError.message = redactedMessage;
       } else if (prop === 'stack') {
         redactedError.stack = redactedStack;
-      } else {
-        redactedError[prop] = redactAny(val, depth + 1, seen);
-      }
+      } else {}
     });
     return redactedError;

[NoCoverage] ArithmeticOperator
src/services/security/logger.ts:71:46
       } else if (prop === 'stack') {
         redactedError.stack = redactedStack;
       } else {
-        redactedError[prop] = redactAny(val, depth + 1, seen);
+        redactedError[prop] = redactAny(val, depth - 1, seen);
       }
     });

[Killed] BlockStatement
src/services/security/logger.ts:77:48
     return redactedError;
   }
 
-  if (arg !== null && typeof arg === 'object') {
-    if (seen.has(arg)) return '[CIRCULAR]';
-    seen.add(arg);
-
-    if (Array.isArray(arg)) {
-      return arg.map((item) => redactAny(item, depth + 1, seen));
-    }
-
-    const redactedObj: Record<string, unknown> = {};
-    for (const [key, value] of Object.entries(arg)) {
-      redactedObj[key] = redactAny(value, depth + 1, seen);
-    }
-    return redactedObj;
-  }
+  if (arg !== null && typeof arg === 'object') {}
 
   return arg;
killedBy: security logger redactSecrets should handle objects
statusReason: expected 'ghp_1234567890abcdefghijklmnopqrstuvw…' to be '[REDACTED]' // Object.is equality

[Killed] ConditionalExpression
src/services/security/logger.ts:78:9
   }
 
   if (arg !== null && typeof arg === 'object') {
-    if (seen.has(arg)) return '[CIRCULAR]';
+    if (false) return '[CIRCULAR]';
     seen.add(arg);
 
killedBy: security logger redactSecrets should handle circular references
statusReason: expected { name: 'circular', self: { …(2) } } to be '[CIRCULAR]' // Object.is equality

[Survived] BlockStatement
src/services/security/logger.ts:81:29
     if (seen.has(arg)) return '[CIRCULAR]';
     seen.add(arg);
 
-    if (Array.isArray(arg)) {
-      return arg.map((item) => redactAny(item, depth + 1, seen));
-    }
+    if (Array.isArray(arg)) {}
 
     const redactedObj: Record<string, unknown> = {};

[Killed] ArrowFunction
src/services/security/logger.ts:82:22
     seen.add(arg);
 
     if (Array.isArray(arg)) {
-      return arg.map((item) => redactAny(item, depth + 1, seen));
+      return arg.map(() => undefined);
     }
 
killedBy: security logger redactSecrets should handle arrays
statusReason: expected undefined to be '[REDACTED]' // Object.is equality

[Survived] ArithmeticOperator
src/services/security/logger.ts:82:48
     seen.add(arg);
 
     if (Array.isArray(arg)) {
-      return arg.map((item) => redactAny(item, depth + 1, seen));
+      return arg.map((item) => redactAny(item, depth - 1, seen));
     }
 

[Killed] BlockStatement
src/services/security/logger.ts:86:53
     }
 
     const redactedObj: Record<string, unknown> = {};
-    for (const [key, value] of Object.entries(arg)) {
-      redactedObj[key] = redactAny(value, depth + 1, seen);
-    }
+    for (const [key, value] of Object.entries(arg)) {}
     return redactedObj;
   }
killedBy: security logger redactSecrets should handle objects
statusReason: expected undefined to be '[REDACTED]' // Object.is equality

[Killed] ArithmeticOperator
src/services/security/logger.ts:87:43
 
     const redactedObj: Record<string, unknown> = {};
     for (const [key, value] of Object.entries(arg)) {
-      redactedObj[key] = redactAny(value, depth + 1, seen);
+      redactedObj[key] = redactAny(value, depth - 1, seen);
     }
     return redactedObj;
killedBy: security logger redactSecrets handles depth limit exceeded
statusReason: expected { val: { val: { val: { …(1) } } } } to deeply equal { val: '[DEPTH_EXCEEDED]' }

[Killed] BooleanLiteral
src/services/security/logger.ts:107:7
 ): Promise<void> {
   // Avoid circular dependency: if DB is being initialized (upgrade in progress),
   // skip persistence to prevent getDB() from throwing before dbInstance is set.
-  if (!isDBReady()) return;
+  if (isDBReady()) return;
 
   try {
killedBy: security logger persistLog skips persistence when DB is not ready
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
src/services/security/logger.ts:107:7
 ): Promise<void> {
   // Avoid circular dependency: if DB is being initialized (upgrade in progress),
   // skip persistence to prevent getDB() from throwing before dbInstance is set.
-  if (!isDBReady()) return;
+  if (false) return;
 
   try {
killedBy: security logger persistLog skips persistence when DB is not ready
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BlockStatement
src/services/security/logger.ts:109:7
   // skip persistence to prevent getDB() from throwing before dbInstance is set.
   if (!isDBReady()) return;
 
-  try {
-    const db = getDB();
-
-    await db.add('logs', {
-      timestamp: Date.now(),
-      level,
-      message,
-      data: redactAny(data),
-    });
-
-    // Rotation: remove old logs if exceeding limit
-    const count = await db.count('logs');
-    if (count > MAX_LOGS) {
-      const logs = await db.getAllKeysFromIndex('logs', 'by-timestamp');
-      const toDelete = logs.slice(0, count - MAX_LOGS);
-      const tx = db.transaction('logs', 'readwrite');
-      for (const id of toDelete) {
-        void tx.objectStore('logs').delete(id);
-      }
-      await tx.done;
-    }
-  } catch (err) {
+  try {} catch (err) {
     // Fallback if DB not ready or failed
     console.error('[Logger] Failed to persist log', err);
killedBy: security logger persistLog persists log entry when DB is ready
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/security/logger.ts:121:9
 
     // Rotation: remove old logs if exceeding limit
     const count = await db.count('logs');
-    if (count > MAX_LOGS) {
+    if (false) {
       const logs = await db.getAllKeysFromIndex('logs', 'by-timestamp');
       const toDelete = logs.slice(0, count - MAX_LOGS);
killedBy: security logger persistLog rotates logs when exceeding MAX_LOGS (1000)
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs', 'readwrite' ]

Number of calls: 0

[Killed] BlockStatement
src/services/security/logger.ts:121:27
 
     // Rotation: remove old logs if exceeding limit
     const count = await db.count('logs');
-    if (count > MAX_LOGS) {
-      const logs = await db.getAllKeysFromIndex('logs', 'by-timestamp');
-      const toDelete = logs.slice(0, count - MAX_LOGS);
-      const tx = db.transaction('logs', 'readwrite');
-      for (const id of toDelete) {
-        void tx.objectStore('logs').delete(id);
-      }
-      await tx.done;
-    }
+    if (count > MAX_LOGS) {}
   } catch (err) {
     // Fallback if DB not ready or failed
killedBy: security logger persistLog rotates logs when exceeding MAX_LOGS (1000)
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs', 'readwrite' ]

Number of calls: 0

[Survived] MethodExpression
src/services/security/logger.ts:123:24
     const count = await db.count('logs');
     if (count > MAX_LOGS) {
       const logs = await db.getAllKeysFromIndex('logs', 'by-timestamp');
-      const toDelete = logs.slice(0, count - MAX_LOGS);
+      const toDelete = logs;
       const tx = db.transaction('logs', 'readwrite');
       for (const id of toDelete) {

[Survived] ArithmeticOperator
src/services/security/logger.ts:123:38
     const count = await db.count('logs');
     if (count > MAX_LOGS) {
       const logs = await db.getAllKeysFromIndex('logs', 'by-timestamp');
-      const toDelete = logs.slice(0, count - MAX_LOGS);
+      const toDelete = logs.slice(0, count + MAX_LOGS);
       const tx = db.transaction('logs', 'readwrite');
       for (const id of toDelete) {

[Survived] BlockStatement
src/services/security/logger.ts:125:34
       const logs = await db.getAllKeysFromIndex('logs', 'by-timestamp');
       const toDelete = logs.slice(0, count - MAX_LOGS);
       const tx = db.transaction('logs', 'readwrite');
-      for (const id of toDelete) {
-        void tx.objectStore('logs').delete(id);
-      }
+      for (const id of toDelete) {}
       await tx.done;
     }

[Killed] BlockStatement
src/services/security/logger.ts:130:17
       }
       await tx.done;
     }
-  } catch (err) {
-    // Fallback if DB not ready or failed
-    console.error('[Logger] Failed to persist log', err);
-  }
+  } catch (err) {}
 }
 
killedBy: security logger persistLog handles DB errors gracefully during persistence
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/services/security/logger.ts:139:68
 /**
  * Safe console.log that redacts secrets and persists offline.
  */
-export function safeLog(message: string, ...args: unknown[]): void {
-  const redactedArgs = args.map((arg) => redactAny(arg));
-  const redactedMessage = redactSecrets(message);
-
-  void persistLog(
-    'info',
-    redactedMessage,
-    redactedArgs.length === 1 ? redactedArgs[0] : redactedArgs
-  );
-}
+export function safeLog(message: string, ...args: unknown[]): void {}
 
 /**
killedBy: security logger safeLog calls persistLog with redacted args
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/services/security/logger.ts:140:33
  * Safe console.log that redacts secrets and persists offline.
  */
 export function safeLog(message: string, ...args: unknown[]): void {
-  const redactedArgs = args.map((arg) => redactAny(arg));
+  const redactedArgs = args.map(() => undefined);
   const redactedMessage = redactSecrets(message);
 
killedBy: security logger safeLog redacts secrets in log arguments
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs', ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    "logs",

[Killed] ConditionalExpression
src/services/security/logger.ts:146:5
   void persistLog(
     'info',
     redactedMessage,
-    redactedArgs.length === 1 ? redactedArgs[0] : redactedArgs
+    false ? redactedArgs[0] : redactedArgs
   );
 }
killedBy: security logger safeLog redacts secrets in log arguments
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs', ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    "logs",

[Killed] EqualityOperator
src/services/security/logger.ts:146:5
   void persistLog(
     'info',
     redactedMessage,
-    redactedArgs.length === 1 ? redactedArgs[0] : redactedArgs
+    redactedArgs.length !== 1 ? redactedArgs[0] : redactedArgs
   );
 }
killedBy: security logger safeLog redacts secrets in log arguments
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs', ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    "logs",

[Killed] BlockStatement
src/services/security/logger.ts:153:70
 /**
  * Safe console.error that redacts secrets and persists offline.
  */
-export function safeError(message: string, ...args: unknown[]): void {
-  const redactedArgs = args.map((arg) => redactAny(arg));
-  const redactedMessage = redactSecrets(message);
-
-  console.error(redactedMessage, ...redactedArgs);
-
-  void persistLog(
-    'error',
-    redactedMessage,
-    redactedArgs.length === 1 ? redactedArgs[0] : redactedArgs
-  );
-}
+export function safeError(message: string, ...args: unknown[]): void {}
 
 /**
killedBy: security logger safeError calls console.error with redacted message
statusReason: expected "error" to be called with arguments: [ 'Failed: [REDACTED]' ]

Number of calls: 0

[Killed] ArrowFunction
src/services/security/logger.ts:154:33
  * Safe console.error that redacts secrets and persists offline.
  */
 export function safeError(message: string, ...args: unknown[]): void {
-  const redactedArgs = args.map((arg) => redactAny(arg));
+  const redactedArgs = args.map(() => undefined);
   const redactedMessage = redactSecrets(message);
 
killedBy: security logger safeError handles multiple arguments
statusReason: expected "error" to be called with arguments: [ 'Error:', 'details', { code: 404 } ]

Received:

  1st error call:

  [
    "Error:",

[Survived] ConditionalExpression
src/services/security/logger.ts:162:5
   void persistLog(
     'error',
     redactedMessage,
-    redactedArgs.length === 1 ? redactedArgs[0] : redactedArgs
+    true ? redactedArgs[0] : redactedArgs
   );
 }

[Killed] BlockStatement
src/services/security/logger.ts:169:69
 /**
  * Safe console.warn that redacts secrets and persists offline.
  */
-export function safeWarn(message: string, ...args: unknown[]): void {
-  const redactedArgs = args.map((arg) => redactAny(arg));
-  const redactedMessage = redactSecrets(message);
-
-  console.warn(redactedMessage, ...redactedArgs);
-
-  void persistLog(
-    'warn',
-    redactedMessage,
-    redactedArgs.length === 1 ? redactedArgs[0] : redactedArgs
-  );
-}
+export function safeWarn(message: string, ...args: unknown[]): void {}
 
 /**
killedBy: security logger safeWarn calls console.warn with redacted message
statusReason: expected "warn" to be called with arguments: [ 'Deprecated: [REDACTED]' ]

Number of calls: 0

[Survived] ArrowFunction
src/services/security/logger.ts:170:33
  * Safe console.warn that redacts secrets and persists offline.
  */
 export function safeWarn(message: string, ...args: unknown[]): void {
-  const redactedArgs = args.map((arg) => redactAny(arg));
+  const redactedArgs = args.map(() => undefined);
   const redactedMessage = redactSecrets(message);
 

[Killed] BlockStatement
src/services/security/logger.ts:193:57
 /**
  * Clear all logs from IndexedDB.
  */
-export async function clearOfflineLogs(): Promise<void> {
-  const db = getDB();
-  await db.clear('logs');
-}
+export async function clearOfflineLogs(): Promise<void> {}
 
killedBy: security logger clearOfflineLogs clears all logs from IndexedDB
statusReason: expected "vi.fn()" to be called with arguments: [ 'logs' ]

Number of calls: 0
