[Killed] BooleanLiteral
src/services/sync/queue.ts:45:23
 const RETRY_MAX_DELAY_MS = 30000;
 
 export class SyncQueue {
-  private isSyncing = false;
+  private isSyncing = true;
   private unsubscribeNetwork?: () => void;
   private abortController = new AbortController();
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/services/sync/queue.ts:49:16
   private unsubscribeNetwork?: () => void;
   private abortController = new AbortController();
 
-  init(): void {
-    this.unsubscribeNetwork = networkMonitor.subscribe((status) => {
-      if (status === 'online') {
-        safeLog('[SyncQueue] Network online, checking pending operations');
-        void this.processQueue();
-      }
-    });
-    window.addEventListener(
-      'app:online',
-      () => {
-        void this.processQueue();
-      },
-      { signal: this.abortController.signal }
-    );
-    safeLog('[SyncQueue] Initialized');
-  }
+  init(): void {}
 
   async queueOperation(
killedBy: SyncQueue init should subscribe to network monitor and register window listener
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
src/services/sync/queue.ts:50:68
   private abortController = new AbortController();
 
   init(): void {
-    this.unsubscribeNetwork = networkMonitor.subscribe((status) => {
-      if (status === 'online') {
-        safeLog('[SyncQueue] Network online, checking pending operations');
-        void this.processQueue();
-      }
-    });
+    this.unsubscribeNetwork = networkMonitor.subscribe((status) => {});
     window.addEventListener(
       'app:online',
killedBy: SyncQueue retry exhaustion and dedup init and destroy processes queue when network status changes to online
statusReason: expected "processQueue" to be called at least once

[Killed] EqualityOperator
src/services/sync/queue.ts:51:11
 
   init(): void {
     this.unsubscribeNetwork = networkMonitor.subscribe((status) => {
-      if (status === 'online') {
+      if (status !== 'online') {
         safeLog('[SyncQueue] Network online, checking pending operations');
         void this.processQueue();
killedBy: SyncQueue retry exhaustion and dedup init and destroy processes queue when network status changes to online
statusReason: expected "processQueue" to be called at least once

[Killed] ConditionalExpression
src/services/sync/queue.ts:51:11
 
   init(): void {
     this.unsubscribeNetwork = networkMonitor.subscribe((status) => {
-      if (status === 'online') {
+      if (false) {
         safeLog('[SyncQueue] Network online, checking pending operations');
         void this.processQueue();
killedBy: SyncQueue retry exhaustion and dedup init and destroy processes queue when network status changes to online
statusReason: expected "processQueue" to be called at least once

[Killed] BlockStatement
src/services/sync/queue.ts:58:13
     });
     window.addEventListener(
       'app:online',
-      () => {
-        void this.processQueue();
-      },
+      () => {},
       { signal: this.abortController.signal }
     );
killedBy: SyncQueue retry exhaustion and dedup init and destroy processes queue when app:online event is dispatched
statusReason: expected "processQueue" to be called at least once

[Survived] StringLiteral
src/services/sync/queue.ts:81:13
       expectedRemoteVersion,
     };
     const id = await dbQueueWrite(write);
-    safeLog(`[SyncQueue] Queued ${action} for gist ${gistId}, queue ID: ${id}`);
+    safeLog(``);
     if (networkMonitor.isOnline()) {
       void this.processQueue();

[Killed] ConditionalExpression
src/services/sync/queue.ts:82:9
     };
     const id = await dbQueueWrite(write);
     safeLog(`[SyncQueue] Queued ${action} for gist ${gistId}, queue ID: ${id}`);
-    if (networkMonitor.isOnline()) {
+    if (true) {
       void this.processQueue();
     }
killedBy: SyncQueue queueOperation does not trigger processQueue when offline
statusReason: expected "processQueue" to not be called at all, but actually been called 1 times

Received:

  1st processQueue call:

    Array []

[Killed] ConditionalExpression
src/services/sync/queue.ts:82:9
     };
     const id = await dbQueueWrite(write);
     safeLog(`[SyncQueue] Queued ${action} for gist ${gistId}, queue ID: ${id}`);
-    if (networkMonitor.isOnline()) {
+    if (false) {
       void this.processQueue();
     }
killedBy: SyncQueue queueOperation triggers processQueue when online
statusReason: expected "processQueue" to be called at least once

[Killed] BooleanLiteral
src/services/sync/queue.ts:89:27
   }
 
   async processQueue(): Promise<void> {
-    if (this.isSyncing || !networkMonitor.isOnline()) return;
+    if (this.isSyncing || networkMonitor.isOnline()) return;
     this.isSyncing = true;
     try {
killedBy: SyncQueue retry exhaustion and dedup processQueue error catch catches and logs error when getPendingWrites rejects
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] LogicalOperator
src/services/sync/queue.ts:89:9
   }
 
   async processQueue(): Promise<void> {
-    if (this.isSyncing || !networkMonitor.isOnline()) return;
+    if (this.isSyncing && !networkMonitor.isOnline()) return;
     this.isSyncing = true;
     try {
killedBy: SyncQueue processQueue does nothing when offline
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BooleanLiteral
src/services/sync/queue.ts:90:22
 
   async processQueue(): Promise<void> {
     if (this.isSyncing || !networkMonitor.isOnline()) return;
-    this.isSyncing = true;
+    this.isSyncing = false;
     try {
       const pendingWrites = await getPendingWrites();
killedBy: SyncQueue processQueue does nothing when already syncing
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/services/sync/queue.ts:93:11
     this.isSyncing = true;
     try {
       const pendingWrites = await getPendingWrites();
-      if (pendingWrites.length === 0) return;
+      if (pendingWrites.length !== 0) return;
       safeLog(`[SyncQueue] Processing ${pendingWrites.length} pending operations`);
       const sortedWrites = pendingWrites.sort((a, b) => a.createdAt - b.createdAt);
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: actual value must be number or bigint, received "undefined"

[Survived] ConditionalExpression
src/services/sync/queue.ts:93:11
     this.isSyncing = true;
     try {
       const pendingWrites = await getPendingWrites();
-      if (pendingWrites.length === 0) return;
+      if (false) return;
       safeLog(`[SyncQueue] Processing ${pendingWrites.length} pending operations`);
       const sortedWrites = pendingWrites.sort((a, b) => a.createdAt - b.createdAt);

[Killed] ArithmeticOperator
src/services/sync/queue.ts:95:57
       const pendingWrites = await getPendingWrites();
       if (pendingWrites.length === 0) return;
       safeLog(`[SyncQueue] Processing ${pendingWrites.length} pending operations`);
-      const sortedWrites = pendingWrites.sort((a, b) => a.createdAt - b.createdAt);
+      const sortedWrites = pendingWrites.sort((a, b) => a.createdAt + b.createdAt);
       for (const write of sortedWrites) {
         if (!write.id) continue;
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: expected 11 to be less than 5

[Killed] MethodExpression
src/services/sync/queue.ts:95:28
       const pendingWrites = await getPendingWrites();
       if (pendingWrites.length === 0) return;
       safeLog(`[SyncQueue] Processing ${pendingWrites.length} pending operations`);
-      const sortedWrites = pendingWrites.sort((a, b) => a.createdAt - b.createdAt);
+      const sortedWrites = pendingWrites;
       for (const write of sortedWrites) {
         if (!write.id) continue;
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: expected 11 to be less than 5

[Killed] BlockStatement
src/services/sync/queue.ts:96:41
       if (pendingWrites.length === 0) return;
       safeLog(`[SyncQueue] Processing ${pendingWrites.length} pending operations`);
       const sortedWrites = pendingWrites.sort((a, b) => a.createdAt - b.createdAt);
-      for (const write of sortedWrites) {
-        if (!write.id) continue;
-
-        if (!isSafeToRequest()) {
-          safeLog('[SyncQueue] Rate limit low, pausing queue processing');
-          break;
-        }
-
-        const result = await this.executeWrite(write);
-        if (result.success) {
-          await removePendingWrite(write.id);
-          safeLog(`[SyncQueue] Successfully synced operation ${write.id}`);
-        } else {
-          if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
-            await updatePendingWriteError(write.id, result.error || 'Unknown error');
-          } else {
-            await updatePendingWriteError(write.id, result.error || 'Max retries reached');
-          }
-        }
-        // Exponential backoff with jitter between operations
-        const backoffMs = SyncQueue.calculateBackoff(write.retryCount ?? 0);
-        await SyncQueue.delay(backoffMs);
-      }
+      for (const write of sortedWrites) {}
     } catch (error) {
       safeError('[SyncQueue] Error processing queue:', error);
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BooleanLiteral
src/services/sync/queue.ts:99:13
       for (const write of sortedWrites) {
         if (!write.id) continue;
 
-        if (!isSafeToRequest()) {
+        if (isSafeToRequest()) {
           safeLog('[SyncQueue] Rate limit low, pausing queue processing');
           break;
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
src/services/sync/queue.ts:99:13
       for (const write of sortedWrites) {
         if (!write.id) continue;
 
-        if (!isSafeToRequest()) {
+        if (false) {
           safeLog('[SyncQueue] Rate limit low, pausing queue processing');
           break;
killedBy: SyncQueue rate limiter integration pauses queue processing when rate limit is low
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {},

[Killed] BlockStatement
src/services/sync/queue.ts:105:29
         }
 
         const result = await this.executeWrite(write);
-        if (result.success) {
-          await removePendingWrite(write.id);
-          safeLog(`[SyncQueue] Successfully synced operation ${write.id}`);
-        } else {
+        if (result.success) {} else {
           if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
             await updatePendingWriteError(write.id, result.error || 'Unknown error');
killedBy: SyncQueue processQueue processes operations in FIFO order
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] BlockStatement
src/services/sync/queue.ts:108:16
         if (result.success) {
           await removePendingWrite(write.id);
           safeLog(`[SyncQueue] Successfully synced operation ${write.id}`);
-        } else {
-          if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
-            await updatePendingWriteError(write.id, result.error || 'Unknown error');
-          } else {
-            await updatePendingWriteError(write.id, result.error || 'Max retries reached');
-          }
-        }
+        } else {}
         // Exponential backoff with jitter between operations
         const backoffMs = SyncQueue.calculateBackoff(write.retryCount ?? 0);
killedBy: SyncQueue processQueue retries on retryable error
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'network error' ]

Number of calls: 0

[Killed] BlockStatement
src/services/sync/queue.ts:109:69
           await removePendingWrite(write.id);
           safeLog(`[SyncQueue] Successfully synced operation ${write.id}`);
         } else {
-          if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
-            await updatePendingWriteError(write.id, result.error || 'Unknown error');
-          } else {
+          if (result.shouldRetry && write.retryCount < MAX_RETRIES) {} else {
             await updatePendingWriteError(write.id, result.error || 'Max retries reached');
           }
killedBy: SyncQueue processQueue retries on retryable error
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'network error' ]

Number of calls: 0

[Survived] LogicalOperator
src/services/sync/queue.ts:109:15
           await removePendingWrite(write.id);
           safeLog(`[SyncQueue] Successfully synced operation ${write.id}`);
         } else {
-          if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
+          if (result.shouldRetry || write.retryCount < MAX_RETRIES) {
             await updatePendingWriteError(write.id, result.error || 'Unknown error');
           } else {

[NoCoverage] StringLiteral
src/services/sync/queue.ts:110:69
           safeLog(`[SyncQueue] Successfully synced operation ${write.id}`);
         } else {
           if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
-            await updatePendingWriteError(write.id, result.error || 'Unknown error');
+            await updatePendingWriteError(write.id, result.error || "");
           } else {
             await updatePendingWriteError(write.id, result.error || 'Max retries reached');

[Killed] BlockStatement
src/services/sync/queue.ts:111:18
         } else {
           if (result.shouldRetry && write.retryCount < MAX_RETRIES) {
             await updatePendingWriteError(write.id, result.error || 'Unknown error');
-          } else {
-            await updatePendingWriteError(write.id, result.error || 'Max retries reached');
-          }
+          } else {}
         }
         // Exponential backoff with jitter between operations
killedBy: SyncQueue retry exhaustion and dedup retry exhaustion stores error and does not remove write when retryCount >= MAX_RETRIES
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'network error' ]

Number of calls: 0

[Survived] LogicalOperator
src/services/sync/queue.ts:116:54
           }
         }
         // Exponential backoff with jitter between operations
-        const backoffMs = SyncQueue.calculateBackoff(write.retryCount ?? 0);
+        const backoffMs = SyncQueue.calculateBackoff(write.retryCount && 0);
         await SyncQueue.delay(backoffMs);
       }

[Killed] BlockStatement
src/services/sync/queue.ts:119:21
         const backoffMs = SyncQueue.calculateBackoff(write.retryCount ?? 0);
         await SyncQueue.delay(backoffMs);
       }
-    } catch (error) {
-      safeError('[SyncQueue] Error processing queue:', error);
-    } finally {
+    } catch (error) {} finally {
       this.isSyncing = false;
     }
killedBy: SyncQueue retry exhaustion and dedup processQueue error catch catches and logs error when getPendingWrites rejects
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/services/sync/queue.ts:121:15
       }
     } catch (error) {
       safeError('[SyncQueue] Error processing queue:', error);
-    } finally {
-      this.isSyncing = false;
-    }
+    } finally {}
   }
 
killedBy: SyncQueue retry exhaustion and dedup processQueue error catch resets isSyncing flag after error
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BooleanLiteral
src/services/sync/queue.ts:122:24
     } catch (error) {
       safeError('[SyncQueue] Error processing queue:', error);
     } finally {
-      this.isSyncing = false;
+      this.isSyncing = true;
     }
   }
killedBy: SyncQueue retry exhaustion and dedup processQueue error catch resets isSyncing flag after error
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] LogicalOperator
src/services/sync/queue.ts:129:11
   private async executeWrite(write: PendingWrite): Promise<SyncResult> {
     try {
       // Pre-write conflict check: verify remote gist hasn't changed since queue time
-      if (write.expectedRemoteVersion && write.action !== 'create') {
+      if (write.expectedRemoteVersion || write.action !== 'create') {
         try {
           const remote = await githubGetGist(write.gistId);
killedBy: SyncQueue executeWrite handles unknown action gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    5,

[Killed] ConditionalExpression
src/services/sync/queue.ts:129:11
   private async executeWrite(write: PendingWrite): Promise<SyncResult> {
     try {
       // Pre-write conflict check: verify remote gist hasn't changed since queue time
-      if (write.expectedRemoteVersion && write.action !== 'create') {
+      if (true) {
         try {
           const remote = await githubGetGist(write.gistId);
killedBy: SyncQueue executeWrite handles unknown action gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    5,

[Killed] BlockStatement
src/services/sync/queue.ts:130:13
     try {
       // Pre-write conflict check: verify remote gist hasn't changed since queue time
       if (write.expectedRemoteVersion && write.action !== 'create') {
-        try {
-          const remote = await githubGetGist(write.gistId);
-          if (remote?.updated_at !== write.expectedRemoteVersion) {
-            const local = await getGist(write.gistId);
-            if (local && remote) {
-              const conflict = detectConflict(local, remote as unknown as GitHubGist) || {
-                gistId: local.id,
-                localVersion: local,
-                remoteVersion: remote,
-                detectedAt: new Date().toISOString(),
-                conflictingFields: ['updated_at'],
-              };
-              await storeConflict(conflict);
-            }
-            return {
-              success: false,
-              error: `Conflict: gist ${write.gistId} was modified remotely since operation was queued`,
-              shouldRetry: false,
-            };
-          }
-        } catch (error) {
+        try {} catch (error) {
           safeError(`[SyncQueue] Pre-write conflict check failed for ${write.gistId}:`, error);
           // Proceed with operation — best-effort conflict detection
killedBy: SyncQueue executeWrite detects pre-write conflict when expectedRemoteVersion mismatches
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/services/sync/queue.ts:132:15
       if (write.expectedRemoteVersion && write.action !== 'create') {
         try {
           const remote = await githubGetGist(write.gistId);
-          if (remote?.updated_at !== write.expectedRemoteVersion) {
+          if (remote?.updated_at === write.expectedRemoteVersion) {
             const local = await getGist(write.gistId);
             if (local && remote) {
killedBy: SyncQueue executeWrite detects pre-write conflict when expectedRemoteVersion mismatches
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/sync/queue.ts:132:67
       if (write.expectedRemoteVersion && write.action !== 'create') {
         try {
           const remote = await githubGetGist(write.gistId);
-          if (remote?.updated_at !== write.expectedRemoteVersion) {
-            const local = await getGist(write.gistId);
-            if (local && remote) {
-              const conflict = detectConflict(local, remote as unknown as GitHubGist) || {
-                gistId: local.id,
-                localVersion: local,
-                remoteVersion: remote,
-                detectedAt: new Date().toISOString(),
-                conflictingFields: ['updated_at'],
-              };
-              await storeConflict(conflict);
-            }
-            return {
-              success: false,
-              error: `Conflict: gist ${write.gistId} was modified remotely since operation was queued`,
-              shouldRetry: false,
-            };
-          }
+          if (remote?.updated_at !== write.expectedRemoteVersion) {}
         } catch (error) {
           safeError(`[SyncQueue] Pre-write conflict check failed for ${write.gistId}:`, error);
killedBy: SyncQueue executeWrite detects pre-write conflict when expectedRemoteVersion mismatches
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/sync/queue.ts:134:34
           const remote = await githubGetGist(write.gistId);
           if (remote?.updated_at !== write.expectedRemoteVersion) {
             const local = await getGist(write.gistId);
-            if (local && remote) {
-              const conflict = detectConflict(local, remote as unknown as GitHubGist) || {
-                gistId: local.id,
-                localVersion: local,
-                remoteVersion: remote,
-                detectedAt: new Date().toISOString(),
-                conflictingFields: ['updated_at'],
-              };
-              await storeConflict(conflict);
-            }
+            if (local && remote) {}
             return {
               success: false,
killedBy: SyncQueue executeWrite detects pre-write conflict when expectedRemoteVersion mismatches
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] ArrayDeclaration
src/services/sync/queue.ts:140:36
                 localVersion: local,
                 remoteVersion: remote,
                 detectedAt: new Date().toISOString(),
-                conflictingFields: ['updated_at'],
+                conflictingFields: [],
               };
               await storeConflict(conflict);

[NoCoverage] StringLiteral
src/services/sync/queue.ts:140:37
                 localVersion: local,
                 remoteVersion: remote,
                 detectedAt: new Date().toISOString(),
-                conflictingFields: ['updated_at'],
+                conflictingFields: [""],
               };
               await storeConflict(conflict);

[Survived] StringLiteral
src/services/sync/queue.ts:146:22
             }
             return {
               success: false,
-              error: `Conflict: gist ${write.gistId} was modified remotely since operation was queued`,
+              error: ``,
               shouldRetry: false,
             };

[Survived] BooleanLiteral
src/services/sync/queue.ts:147:28
             return {
               success: false,
               error: `Conflict: gist ${write.gistId} was modified remotely since operation was queued`,
-              shouldRetry: false,
+              shouldRetry: true,
             };
           }

[Killed] BlockStatement
src/services/sync/queue.ts:150:25
               shouldRetry: false,
             };
           }
-        } catch (error) {
-          safeError(`[SyncQueue] Pre-write conflict check failed for ${write.gistId}:`, error);
-          // Proceed with operation — best-effort conflict detection
-        }
+        } catch (error) {}
       }
 
killedBy: SyncQueue retry exhaustion and dedup pre-write conflict check error logs error and proceeds when conflict check network call fails
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/services/sync/queue.ts:151:21
             };
           }
         } catch (error) {
-          safeError(`[SyncQueue] Pre-write conflict check failed for ${write.gistId}:`, error);
+          safeError(``, error);
           // Proceed with operation — best-effort conflict detection
         }
killedBy: SyncQueue retry exhaustion and dedup pre-write conflict check error logs error and proceeds when conflict check network call fails
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "[SyncQueue] Pre-write conflict check failed for gist-1:",

[Killed] BooleanLiteral
src/services/sync/queue.ts:166:25
       };
       const handler = handlers[write.action];
       if (handler) return await handler();
-      return { success: false, error: `Unknown action: ${write.action}`, shouldRetry: false };
+      return { success: true, error: `Unknown action: ${write.action}`, shouldRetry: false };
     } catch (error) {
       return {
killedBy: SyncQueue executeWrite handles unknown action gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Survived] BooleanLiteral
src/services/sync/queue.ts:166:87
       };
       const handler = handlers[write.action];
       if (handler) return await handler();
-      return { success: false, error: `Unknown action: ${write.action}`, shouldRetry: false };
+      return { success: false, error: `Unknown action: ${write.action}`, shouldRetry: true };
     } catch (error) {
       return {

[Killed] BooleanLiteral
src/services/sync/queue.ts:179:23
   private static async syncCreate(_gistId: string, payload: unknown): Promise<SyncResult> {
     const gist = await createGist(payload as CreateGistRequest);
     await saveGist(SyncQueue.githubGistToRecord(gist));
-    return { success: true, shouldRetry: false };
+    return { success: false, shouldRetry: false };
   }
 
killedBy: SyncQueue retry exhaustion and dedup dedup invalidation processes create then delete for same gist in order
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Received:

  1st vi.fn() call:

  [
-   1,

[Survived] BooleanLiteral
src/services/sync/queue.ts:179:42
   private static async syncCreate(_gistId: string, payload: unknown): Promise<SyncResult> {
     const gist = await createGist(payload as CreateGistRequest);
     await saveGist(SyncQueue.githubGistToRecord(gist));
-    return { success: true, shouldRetry: false };
+    return { success: true, shouldRetry: true };
   }
 

[Killed] BooleanLiteral
src/services/sync/queue.ts:191:23
   private static async syncDelete(gistId: string): Promise<SyncResult> {
     await deleteGist(gistId);
     await dbDeleteGist(gistId);
-    return { success: true, shouldRetry: false };
+    return { success: false, shouldRetry: false };
   }
 
killedBy: SyncQueue retry exhaustion and dedup dedup invalidation processes create then delete for same gist in order
statusReason: expected "vi.fn()" to be called with arguments: [ 2 ]

Received:

  1st vi.fn() call:

  [
-   2,

[Survived] BooleanLiteral
src/services/sync/queue.ts:191:42
   private static async syncDelete(gistId: string): Promise<SyncResult> {
     await deleteGist(gistId);
     await dbDeleteGist(gistId);
-    return { success: true, shouldRetry: false };
+    return { success: true, shouldRetry: true };
   }
 

[Survived] BooleanLiteral
src/services/sync/queue.ts:196:42
 
   private static async syncStar(gistId: string): Promise<SyncResult> {
     await starGist(gistId);
-    return { success: true, shouldRetry: false };
+    return { success: true, shouldRetry: true };
   }
 

[Survived] BooleanLiteral
src/services/sync/queue.ts:196:23
 
   private static async syncStar(gistId: string): Promise<SyncResult> {
     await starGist(gistId);
-    return { success: true, shouldRetry: false };
+    return { success: false, shouldRetry: false };
   }
 

[Survived] BooleanLiteral
src/services/sync/queue.ts:201:23
 
   private static async syncUnstar(gistId: string): Promise<SyncResult> {
     await unstarGist(gistId);
-    return { success: true, shouldRetry: false };
+    return { success: false, shouldRetry: false };
   }
 

[Survived] BooleanLiteral
src/services/sync/queue.ts:201:42
 
   private static async syncUnstar(gistId: string): Promise<SyncResult> {
     await unstarGist(gistId);
-    return { success: true, shouldRetry: false };
+    return { success: true, shouldRetry: true };
   }
 

[Survived] BooleanLiteral
src/services/sync/queue.ts:233:16
       gitPushUrl: gist.git_push_url,
       createdAt: gist.created_at,
       updatedAt: gist.updated_at,
-      starred: false,
+      starred: true,
       public: gist.public,
       owner: gist.owner

[Killed] BlockStatement
src/services/sync/queue.ts:249:33
   }
 
   private static isRetryableError(error: unknown): boolean {
-    if (error instanceof Error) {
-      const message = error.message.toLowerCase();
-      return (
-        message.includes('network') ||
-        message.includes('fetch') ||
-        message.includes('rate limit') ||
-        message.includes('timeout')
-      );
-    }
+    if (error instanceof Error) {}
     return false;
   }
killedBy: SyncQueue isRetryableError is retryable for network errors
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/services/sync/queue.ts:250:23
 
   private static isRetryableError(error: unknown): boolean {
     if (error instanceof Error) {
-      const message = error.message.toLowerCase();
+      const message = error.message.toUpperCase();
       return (
         message.includes('network') ||
killedBy: SyncQueue isRetryableError is retryable for network errors
statusReason: expected false to be true // Object.is equality
