[Killed] ConditionalExpression
src/services/sync/queue.ts:252:9
     if (error instanceof Error) {
       const message = error.message.toLowerCase();
       return (
-        message.includes('network') ||
-        message.includes('fetch') ||
-        message.includes('rate limit') ||
-        message.includes('timeout')
+        true
       );
     }
killedBy: SyncQueue isRetryableError is not retryable for non-network errors
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/sync/queue.ts:252:9
     if (error instanceof Error) {
       const message = error.message.toLowerCase();
       return (
-        message.includes('network') ||
-        message.includes('fetch') ||
-        message.includes('rate limit') ||
-        message.includes('timeout')
+        false
       );
     }
killedBy: SyncQueue isRetryableError is retryable for network errors
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/services/sync/queue.ts:253:26
       const message = error.message.toLowerCase();
       return (
         message.includes('network') ||
-        message.includes('fetch') ||
+        message.includes("") ||
         message.includes('rate limit') ||
         message.includes('timeout')
killedBy: SyncQueue isRetryableError is not retryable for non-network errors
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/services/sync/queue.ts:255:26
         message.includes('network') ||
         message.includes('fetch') ||
         message.includes('rate limit') ||
-        message.includes('timeout')
+        message.includes("")
       );
     }
killedBy: SyncQueue isRetryableError is not retryable for non-network errors
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/sync/queue.ts:266:43
    * Respects server Retry-After headers when available.
    */
   private static calculateBackoff(attempt: number, retryAfterMs?: number): number {
-    if (retryAfterMs && retryAfterMs > 0) {
-      return retryAfterMs;
-    }
+    if (retryAfterMs && retryAfterMs > 0) {}
     const base = RETRY_BACKOFF_MS;
     const max = RETRY_MAX_DELAY_MS;
killedBy: SyncQueue calculateBackoff respects Retry-After value when provided
statusReason: expected 1821.136794432443 to be 5000 // Object.is equality

[Killed] EqualityOperator
src/services/sync/queue.ts:266:25
    * Respects server Retry-After headers when available.
    */
   private static calculateBackoff(attempt: number, retryAfterMs?: number): number {
-    if (retryAfterMs && retryAfterMs > 0) {
+    if (retryAfterMs && retryAfterMs <= 0) {
       return retryAfterMs;
     }
killedBy: SyncQueue calculateBackoff respects Retry-After value when provided
statusReason: expected 1475.4928241486016 to be 5000 // Object.is equality

[Killed] ArithmeticOperator
src/services/sync/queue.ts:271:25
     }
     const base = RETRY_BACKOFF_MS;
     const max = RETRY_MAX_DELAY_MS;
-    const exponential = base * 2 ** attempt;
+    const exponential = base / 2 ** attempt;
     const jitter = Math.random() * base;
     return Math.min(exponential + jitter, max);
killedBy: SyncQueue calculateBackoff calculates exponential backoff with jitter
statusReason: expected 1258.29631891787 to be greater than or equal to 2000

[Survived] ArithmeticOperator
src/services/sync/queue.ts:272:20
     const base = RETRY_BACKOFF_MS;
     const max = RETRY_MAX_DELAY_MS;
     const exponential = base * 2 ** attempt;
-    const jitter = Math.random() * base;
+    const jitter = Math.random() / base;
     return Math.min(exponential + jitter, max);
   }

[Killed] MethodExpression
src/services/sync/queue.ts:273:12
     const max = RETRY_MAX_DELAY_MS;
     const exponential = base * 2 ** attempt;
     const jitter = Math.random() * base;
-    return Math.min(exponential + jitter, max);
+    return Math.max(exponential + jitter, max);
   }
 
killedBy: SyncQueue calculateBackoff calculates exponential backoff with jitter
statusReason: expected 30000 to be less than 2000

[Killed] ArithmeticOperator
src/services/sync/queue.ts:273:21
     const max = RETRY_MAX_DELAY_MS;
     const exponential = base * 2 ** attempt;
     const jitter = Math.random() * base;
-    return Math.min(exponential + jitter, max);
+    return Math.min(exponential - jitter, max);
   }
 
killedBy: SyncQueue calculateBackoff calculates exponential backoff with jitter
statusReason: expected 122.20253511540716 to be greater than or equal to 1000

[NoCoverage] ArrowFunction
src/services/sync/queue.ts:277:24
   }
 
   private static delay(ms: number): Promise<void> {
-    return new Promise((resolve) => setTimeout(resolve, ms));
+    return new Promise(() => undefined);
   }
 

[Killed] BlockStatement
src/services/sync/queue.ts:285:19
     return writes.length;
   }
 
-  destroy(): void {
-    this.abortController.abort();
-    if (this.unsubscribeNetwork) this.unsubscribeNetwork();
-    safeLog('[SyncQueue] Destroyed');
-  }
+  destroy(): void {}
 }
 
killedBy: SyncQueue destroy cleans up network subscription
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/services/sync/queue.ts:288:13
   destroy(): void {
     this.abortController.abort();
     if (this.unsubscribeNetwork) this.unsubscribeNetwork();
-    safeLog('[SyncQueue] Destroyed');
+    safeLog("");
   }
 }
